{"cid": "UghVQKs9C5CDl3gCoAEC", "text": "Second best castle theme, right behind Courage and Pride.", "time": "3 years ago", "author": "Moises", "channel": "UCO-j9wj2s3fbIdSV1EM0WEA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw6CX9eS9g-WkAG9ynuDW9KYN6-9ckWKLJFpTDH=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg_qJ0tk8_eQngCoAEC", "text": "I recently started playing this game, after having heard so much of its music on this channel (and playing Lufia I first). It's a really \"serious fun\" game, and the soundtrack is an absolute joy to listen to. : D So thank you very much for introducing me to the series in general and this game in particular, SupraDarky! : )", "time": "4 years ago", "author": "LordMyoo", "channel": "UC-sJdDVqIdMsgVycZ3UYZOQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxURZYHVJ-gMaSXjDPD3sGRKeyNB5zA--nVuQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiGqj-251CQRXgCoAEC", "text": "First word that comes to my mind when I hear this song is Dekar :)", "time": "4 years ago", "author": "KingShade1", "channel": "UCZKxMXUAUOCCq_mbPXBw7Jg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyb_ZzOdZrk1Is_VmurkklOmDTqu4oj0sWeqIL7=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgibJ46THmMQ2ngCoAEC", "text": "for some reason, i recall this music is the same as PS1 Ez-Ergheiz dungeon mode (shop ost)", "time": "6 years ago", "author": "David Yos", "channel": "UCrtp9Tb5e15yVX3BCkUVU1Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxkwaymOTz-HeJgaxkAj0pnjIZUJrzEcgMBjtuYkg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjvmJf1Z28mXXgCoAEC", "text": "My god this song....wow", "time": "6 years ago", "author": "Steven Rogers", "channel": "UCYme5kIPMcJDpmKQ-wAmmrw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxXSXkrW4ISN9PzfbFiA6EFme9-sE9BHatd4JWt=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiSs5LS5lCg0XgCoAEC", "text": "Best game ever :)", "time": "6 years ago", "author": "PiixL", "channel": "UCZa-o-mFQQTS-cHR3iPzJtQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyP37g5U6_9d_rEelVkzkhPfvb3fesZ4OknaLWf=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg0L0lTZi_j-XgCoAEC", "text": "Sounds like a cross between Mushroom Kingdom from Super Mario RPG and Edgar and Sabin's theme from Final Fantasy VI.", "time": "6 years ago", "author": "SMRPGFAN101", "channel": "UC50BxktKxmzoV4Ugb1jwsjg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJyFsQPR7uqt9LipKj-Ioy03lG10twWRoCw9Mw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghtDAVnPVM8FHgCoAEC", "text": "I have really fond memories of Lufia 2. I loved it as a kid because it had a lot of puzzles that made you think (such as the coloured blocks puzzles). I haven't found puzzles like that in any other JRPG.", "time": "6 years ago", "author": "ulfy01", "channel": "UCcVx0nLzmqQmh1sYsEUmpZg", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJwFJtvYEkTReKoB2n3FNBEZ9bQrLfctvnJ9d8C-=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggnAiWvF05TXXgCoAEC", "text": "This was a nice RPG... I don't why but I only got half way thru this game and stopped playing... Loved the puzzles in the dungeons... And I especially loved the boss battle music...I need to give this game another shot...", "time": "6 years ago", "author": "XxWOLFRxX", "channel": "UCYNjN55NmPCpXsOVmc5aK7g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy5Kym5mEY7NBpdHn2Fz6sunLmRZBZLJUQcLw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgggjtqjUXzHb3gCoAEC", "text": "I wouldn't mind them making another Lufia. I may have heard that the studio that created it has disbanded though.", "time": "6 years ago", "author": "Kyle Sibley", "channel": "UC_h5jl6cc5Ohkt5uDZw-YwQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyNB3wuP14epfUDP0cEtIMEI__-eBTtBWtE8iLrdg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugh10Uvp8bqSS3gCoAEC", "text": "This, Chrono Trigger, Breath of Fire 2, Twewy and FFTA are my favourite Games for Nintendo consoles. The idea behind the remake wasn't bad, but it was lacking in many places. The technical limitations of 3D, the UI, Lexis being Mr Exposition but not having the ability to explain how any of his inventions work are just a few. Also the level design had many objects that felt really out of place. Brightly coloured raising plattforms in the wilderness, futuristic doors next to wooden logs, etc. If they had had 3 month more to work on it, it could have been a nice game.", "time": "6 years ago", "author": "TheAriusDural", "channel": "UCqJ4-v1HZrjlav68sqZct9Q", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJxFftJKYm5GbmOlL8i5YuyhD1Gwk4qQboYaGg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggRUIKM6S9ZB3gCoAEC", "text": "This is one of the games I was totally addicted to. The story, music and feel of the game in general made it soothing and mysterious at the same time.", "time": "6 years ago", "author": "Gardinnas", "channel": "UCF3EeHGlK4a10pC5zeUv7OQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJxKHQPd5_Pgj9tAl7KS1UDUIxOBbeRZFKDL57PD=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggMtXQxQEP2YHgCoAEC", "text": "l don't know how l missed this game back when l had a Super Nintendo, but all l remember playing was Mario, Mario Paint and Street Fighter 2.", "time": "6 years ago", "author": "TigerPrincess", "channel": "UCDyS3OSoXL0KgT6GXG-02Qw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzJhrN_zDCQgP5WMuioj3BWMNsZ7EuAtPTuXw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC", "text": "I always thought the characters in the boxart looked so weird compared to the characters in the games, for most SNES RPGs.", "time": "6 years ago", "author": "Hawlo", "channel": "UCgg5HS1oVuMSoGRPuHo-b_A", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJwFOyP4aGtqKluveOJzFzyXeL_XNepd4VjI6zTa=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd27AoitBuYOA7", "text": "Take Mystic Quest as a good example.", "time": "5 years ago", "author": "Acrophis", "channel": "UCibkXMq0IkNd-BrGX2EnyGw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxLUiR2sGQZXGS8F6-1EanavspIK9touRECi3ihcA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28eaKqYqJpvV", "text": "Part of that for some games outside Japan was to avoid a \"cute anime\" style that localizers were afraid would turn off Western gamers.", "time": "2 years ago", "author": "Ambrose Burnout", "channel": "UCfy83OlDuhaoo2vlDCFotyA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw2QKvd0Ic4jfJyutkIvfsSlpP_5DlP3G4gAZ9ieg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mUJXqGK_99", "text": "@Ambrose Burnout Interesting. Westerners being westerners: Prioritizing realism over everything else, even at the cost of beauty (most of those western boxart were very ugly, despite some of them being somehow realistic). Japanese tend to be the opposite: Prioritizing beauty even at the cost of realism, because of things like that that the artistic movement chibi and moe became what they are I suppose.", "time": "1 year ago (edited)", "author": "iuri Lua", "channel": "UCTSZ99Pbq9uaCvI5NsZhnGQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzGoLx-_PCZ-lZ4YiuwvJrP7Oa0BQ20tYUn25gnTQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mWQAoUKPqk", "text": "And you know what, it's all bull. I'm as American as a truck stop or a drive-in and I can't get enough cute anime characters.", "time": "1 year ago", "author": "Ambrose Burnout", "channel": "UCfy83OlDuhaoo2vlDCFotyA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw2QKvd0Ic4jfJyutkIvfsSlpP_5DlP3G4gAZ9ieg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mXuGVZh9Bi", "text": "​@Ambrose Burnout What's that supposed to mean exactly? That this tendency doesn't exist because you're american and have other inclinations in art? Or did I got it wrong?", "time": "1 year ago", "author": "iuri Lua", "channel": "UCTSZ99Pbq9uaCvI5NsZhnGQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzGoLx-_PCZ-lZ4YiuwvJrP7Oa0BQ20tYUn25gnTQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mY9dzw25Tj", "text": "Well, that tendency you talked about does kind of exist, but it's massively overblown by corporate decision makers and a small number of people who think anime is either the work of the devil or this font of social injustice. Everyone else I've shown cute anime pictures to has at least kind of liked them too, and there are thousands, maybe even tens of thousands of European and American anime lovers all over the internet. Even in Japan there are plenty of people who think cute sexy anime characters are for creeps.\n\nI think game developers in the late 80s and early 90s changed the box arts because back then anime was new and strange here, and not as many people liked it as do now. Now enough people like anime that companies don't change the box arts anymore.", "time": "1 year ago (edited)", "author": "Ambrose Burnout", "channel": "UCfy83OlDuhaoo2vlDCFotyA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw2QKvd0Ic4jfJyutkIvfsSlpP_5DlP3G4gAZ9ieg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mZWRtztNcV", "text": "@Ambrose Burnout I see, I agree with you but I was referring to the artists point of view, not the consumer's. Often enough I see western artists trying to incorporate the anime style in their art and failing somehow at it. Take Time Spinner for example, the portrait art is confusing, it seems to try the anime style/or a cartoon hybrid (fancy hair colors, big eyes) but the artist seems clueless as to \"what\" make anime style what it is, so he/she doesn't notice he's making the character portraits too realistic (well defined nose, mouth and general facial structure) at the point it seems kind of ugly (some players have even said they didn't knew the protagonist was a female), whereas the essence of the anime style is basically being cute as a priority, thus the facial features becoming less defined and more simplified aiming at cuteness.\nWell, that's just an opinion from another artist (myself), because of course there are several western artists who make awesome anime art and hybrids in the likes of it, but it's interesting to see some artists showing those tendencies more than others.", "time": "1 year ago (edited)", "author": "iuri Lua", "channel": "UCTSZ99Pbq9uaCvI5NsZhnGQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzGoLx-_PCZ-lZ4YiuwvJrP7Oa0BQ20tYUn25gnTQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mZZ8eNzmyK", "text": "Yeah, I see what you describe now a lot. It must be common enough that one good western anime-styled artist made a book on how to avoid it. Though, Timespinner has other problems. Characters bring up their sexuality out of nowhere, and the good guys are entirely female-led while the bad guys are entirely male-led, though I'm not sure how much the latter gets brought up in the plot.\n\nAlso, sorry for not bringing up two comments ago what I explained in my last comment. Yesterday was not a day when I could articulate myself well.", "time": "1 year ago", "author": "Ambrose Burnout", "channel": "UCfy83OlDuhaoo2vlDCFotyA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJw2QKvd0Ic4jfJyutkIvfsSlpP_5DlP3G4gAZ9ieg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mZatt2P4Vm", "text": "@Ambrose Burnout Interesting, did you remember the name of the book? And it teaches how to avoid it...? The mistakes while trying to emulate the anime style? (just to be sure).\nI didn't play the game myself, but I can imagine what you're saying. That also explains why the art is kind of confusing in what it's trying to go for. SJWs don't seem to get art very well, because they seem to care more about their agenda than everything else. \n\nTake Crunchyroll's High Guardian Spice for example: They have the guts to call that \"anime\" or \"anime inspired\", when you can clearly see it's just another western oriented production inside out (look at the poster and it's easy to see some Steven Universe influence). They seem to think it'll be considered \"anime\" if it has big eyes in every character lol (and I won't even start about their political agenda...)\n\nAlso, no problem man, It's cool that I could understand your point in the end and even have learned a few things with ya. Hope you're well!", "time": "1 year ago (edited)", "author": "iuri Lua", "channel": "UCTSZ99Pbq9uaCvI5NsZhnGQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzGoLx-_PCZ-lZ4YiuwvJrP7Oa0BQ20tYUn25gnTQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28mar5-uJXFa", "text": "I have the book, it's called Mastering Manga with Mark Crilley (the author also made Akiko). It assumes you know what the nose and mouth are supposed to look like but teaches you the right way to draw everything anyway. I'm glad to help an artist with their art.\n\nCrossCode and Secrets of Grindea both have the same type of character art with big anime eyes but overly defined noses and mouths, but I can't find anyone complaining about any overpowering ideology in either game. So no, now that I look at more games with \"fake anime\" art I don't think this is entirely a left-authoritarian or even general radical ideologue problem. It's more of a general but not universal misconception about what anime art is like outside East Asia.", "time": "1 year ago (edited)", "author": "Ambrose Burnout", "channel": "UCfy83OlDuhaoo2vlDCFotyA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw2QKvd0Ic4jfJyutkIvfsSlpP_5DlP3G4gAZ9ieg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28msq96F4Er1", "text": "@Ambrose Burnout Thanks! Interesting premise and all. And yeah. Sorry for being late to answer you this time.\n\nOh, I agree with you. I don't think this is somehow a problem in the left, as I was saying this was a problem in western artists in general as you've read. What I did tried to say though was that the leftists particularly have a lot of misconceptions about art specifically, for example their demand for \"diversity\" in comics/games, their demand for \"realistic boobs\" in anime stuff and so on. Like, they try to prioritize their political view above creative freedom and that can show (potentially) a lack of understanding in how art truly works. They prefer to change a character's skin color or sexuality than to add more character to them. Recently they changed Isaac's design from Castlevania: Curse of Darkness in the new season planned for the Netflix Castlevania series:\n\nOriginal: https://vignette.wikia.nocookie.net/castlevania/images/9/99/Isaac.png/revision/latest?cb=20170929204539&path-prefix=pt-br\n\nNetflix's ver: https://vignette.wikia.nocookie.net/villains/images/d/da/Isaac_animation_2.jpg/revision/latest?cb=20181009223250\n\n As you can compare, the rich aesthetic value the original design had is totally lost, apparently just to ensure the leftist demand for diversity is reached. They prefere statements over art quality (as you can see the redesign is just plain bad or simpler than the original) in a lot of situations, that can show a real tendency. But it's just an idea I've observed, so take it with a grain of salt.", "time": "1 year ago (edited)", "author": "iuri Lua", "channel": "UCTSZ99Pbq9uaCvI5NsZhnGQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzGoLx-_PCZ-lZ4YiuwvJrP7Oa0BQ20tYUn25gnTQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugje9ABEsfUDi3gCoAEC.7-H0Z7-6cd28n-jDhbF0gQ", "text": "@iuri Lua Don't worry about answering me late. I myself wasn't sure your comment merited a response, but now I think it does.\n\nIt is possible to get across some moderate leftist messages without resorting to sacrificing genuine artistic merit, but if a message, left- or right-wing, just can't be in media without it feeling heavy-handed, it's a pretty good indication that that message specifically is a bad one. This poor grasp of art also might have to do with people making well-intentioned but misguided attempts to appease people who either get offended at something no matter what, or pretend to be offended to shut down art they don't like. The latter group also don't seem to understand that what is bad for them might be good for someone else. But other than that, your analysis was right on.", "time": "1 year ago", "author": "Ambrose Burnout", "channel": "UCfy83OlDuhaoo2vlDCFotyA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw2QKvd0Ic4jfJyutkIvfsSlpP_5DlP3G4gAZ9ieg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg0maogwHoijHgCoAEC", "text": "Please bring these games to the VC Nintendo please!!!!", "time": "6 years ago", "author": "Robin Glick", "channel": "UCVhjj_TMPMXr9_cYIQuJdSg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJww6TR8reNx6ZyF2fmFMDh6AL9MuJrzpVUfDLPe9w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugiiu3Ph9GnQv3gCoAEC", "text": "One of my favorite RPGs on the SNES, absolutely love this game. I also really like its prequel, which has a nice nostalgic charm to it. I haven't played the DS remake of this game but I haven't heard good things about it. It says \"Natsume - Serious Fun\" on the box and that's very much true with Lufia II. Oh and I personally loved the 100 floors labyrinth!", "time": "6 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "22", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugiiu3Ph9GnQv3gCoAEC.7-H0Z7-6xqI79Prtl9GiYt", "text": "actually 99 floors.Labyrinth would be a stretch as well :P", "time": "5 years ago", "author": "SirenoftheVoid", "channel": "UC28BGhO0n6e02aIpgdZEI1g", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJycAWcpiHL-uEZ_RxR2Cr50pcmhR1mXZsXmwx0K=s48-c-k-c0xffffffff-no-rj-mo"}
