{"cid": "Ugz2qrijJGP_aKEQz2B4AaABAg", "text": "I think if I'd never played Terraria I might have liked this game, but to me (played before 1.0 and never went back), it was a pale imitation. Haven't been back because so many other games compete for my time, including the various Terraria updates ;)", "time": "1 year ago", "author": "k9wazere", "channel": "UCLtFdMFOsQmUCtDpgGXWgPg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJximCXRXgY7ZV4KN9xxrwFqK2WcIIaFwb8XoA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgwCyWfrntfA5Qgqnw14AaABAg", "text": "I have no clue why, but in my head, this song would sound like a heavenly sounding version of Saria's Woods. I think it's reminding me of the Twilight Princess version of the song the most. But the song's really beautiful regardless", "time": "2 years ago", "author": "Nikka A [CBF]", "channel": "UCW5lDnZ6vujennyXPTgROXg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyaX2hW05UQ4lYjrjb_bRveRm5TLKT33-WUQLNu4A=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjSPlmyQXKDLngCoAEC", "text": "This song is very inspirational and gets my imagination running wild. Awesome upload brother", "time": "4 years ago", "author": "16bitakira", "channel": "UCf1LJ9ufkvEh5dX2g7HVeaw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx8y8b7JSuk_EFY8APEfSTpVVKqGSqanq8MS9pPpQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjO9qJzKS90-3gCoAEC", "text": "Curtis Schweitzer is going places.", "time": "4 years ago", "author": "Pulsar", "channel": "UCs2HyCSoHI7nZUB2vosU6ag", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzoU0Hiw-AfMRbGotldIxV2QRQAwYL1tB_6cHm4=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghcUKPPXCDxZHgCoAEC", "text": "I'm sorry, but I've heard this so many times that I hate it now. It's beautiful, but stale to me.", "time": "5 years ago", "author": "DAL_nug", "channel": "UCEbZ3jhnJmjhYQ0KctKtnCg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJye0uk3VKLcNghdbbBg91UaW4nnZGIMKj83BzwX2g=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghuVBegmxsDPXgCoAEC", "text": "Starbound gets reluctant love from me. The current unstable build is miraculous, but the progress has been much too slow. Even for an indie early access game. Whether it's dev laziness or whatever, more should have been completed by now. The current unstable branch is a large step in the right direction, but I fear that after the 1.0 release the game will stagnate for another year again, if not longer. ", "time": "5 years ago", "author": "Braduk", "channel": "UCeTk0ERFyaMZgKlq2mjDLnA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzrZD9zbeh_X4H7cJzkCTWzTpbRVZx2F3tmXGfb=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggnGjIn7nVYm3gCoAEC", "text": "Ahem.  My annoyances with the development cycle of the game aside, I really do love this theme.  It also reminds me a lot of Metroid Prime 3's Skyworld Elysia, except with a piano melody overlaid and a bit more of an uptempo beat to it.", "time": "5 years ago", "author": "Honatuto", "channel": "UCpI5fzJCqVAwIkHRW5r_jwA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzqpg2IHfktT6K--1MCR08l7uz5PDpLWEOhYacy=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Uggzx0Q32KJK63gCoAEC", "text": "Wow, I'm seeing so much hate from early access players.\n\nHave you guys worked in the gaming industry before? I'll assume you all didn't.\nIndie games need patience and love, especially given how small the Starbound team is - I've been on some projects myself and I can assure you they're doing a great job for being so little. About that bio-luminescence and whole beach ball thing, I believe they just give one of these out from time to time because they do not take too much time and it shows the community they ARE still active. It's better than to have no info for 5 months straight.\n\nTo people complaining they used the money too \"boo, change offices!\" - They were working pretty far from each other and let me tell you, when the person you're working with is not in your timezone, life is hella hard for the project and the group in general. I'm glad the money I gave to the kickstarter helped their company grow, get together and get more productive.\n\nNow, the game is in early access, of course it's incomplete. Why not waiting for the final version while playing with some of the community's mods or making hardcore runs with friends? If you wish for it to go faster, graduate some artsy/tech related school and go send them your resume.", "time": "5 years ago", "author": "Meishali", "channel": "UCDRitO5ZO7BxzBpEqUBQoww", "votes": "9", "photo": "https://yt3.ggpht.com/a/AATXAJxpwYw8Ya2H4UNVJFk246jBTRYk-kcriO1Yyaxd=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugh1Fcy_GEDh73gCoAEC", "text": "This is a beautiful composition.", "time": "5 years ago", "author": "Brian Trang", "channel": "UC8kD4rVeoZcLnTcvZA1avdg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwDsZKaKgHZZDfOSsRC9UsUhSH4d3w7p_IHmYEOzw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughj4l1e4z-T63gCoAEC", "text": "Starbound is something of a tremendous joke when it comes to development.  They've done some scummy things, such as \"BRB taking Kickstarter money to change offices\" and \"We plan on having stable builds every couple of months\" (and there hasn't been one since March.)  Sure, there are nightlies, but I can't play with my insular group of friends on those, and playing on stable leads to massive loading times on chunks while trying to explore planetsides (plus those of us with awful computers have issues on planets with pink skies, for some reason.)", "time": "5 years ago", "author": "Honatuto", "channel": "UCpI5fzJCqVAwIkHRW5r_jwA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJzqpg2IHfktT6K--1MCR08l7uz5PDpLWEOhYacy=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughj4l1e4z-T63gCoAEC.7-H0Z7-KG8Y7-H1x_Nl6Ex", "text": "It really is the worst. All I wanted was terraria in space. I suppose that's hard to do when a main part of terraria is building up your map, and with the limitless supply of worlds that starbound has it makes it feel pointless. The NPC's don't do anything to help with the story-less environment. If anyone can think of a way to fix this it'd be great.", "time": "5 years ago", "author": "Brig", "channel": "UCtM25QWNCS2ybznVIT5jZKw", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzJKWs93otQVm8IAcew6TS4EsZeZ3xu-LZKe8Ow=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughj4l1e4z-T63gCoAEC.7-H0Z7-KG8Y7-JrO5KCa2i", "text": "They have big ass issues keeping to one project. It's like they're trying to throw fifty things at you at once.\n\"Oh, we have beachballs!\"\n\"BIOLUMINESCENCE \"\n\"HEY LOOK, MOTHER SHIPS!!!!\"\nFor the love of God just focus on one thing.", "time": "5 years ago", "author": "Sunny Rustles", "channel": "UClOT2mkpY08mwCYyCipaCgQ", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJwG7IYgsvcaIlQiXmWfMeqHOVAPawGS3-YfqOQ9=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughj4l1e4z-T63gCoAEC.7-H0Z7-KG8Y71aYavLpvzS", "text": "@KillerBrig What do you think of the new update? with the quests and whatnot?", "time": "5 years ago", "author": "Nedoxu", "channel": "UCk5IvBjbwq3FDmvn0fQdeqg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwXu3K4B9NAWOw2ZO9gpEG9_NtMxUQZa94LqlH3=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughj4l1e4z-T63gCoAEC.7-H0Z7-KG8Y71cFmYxwMxj", "text": "Still not really a fan, feels half assed and my \"super computer\" struggles to keep 60 fps on the hubworld.\nProgression still feels shitty as well, like it's just sort of a placeholder.", "time": "5 years ago", "author": "Brig", "channel": "UCtM25QWNCS2ybznVIT5jZKw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzJKWs93otQVm8IAcew6TS4EsZeZ3xu-LZKe8Ow=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughj4l1e4z-T63gCoAEC.7-H0Z7-KG8Y71clFgzgnmo", "text": "@KillerBrig I disagree. The progression feels way better than it used to imo.\n\nAlthough it COULD use... some building upon.\n\nFramerate is a fairly obvious optimization issue. That's not a valid complaint until the game is actually out, since it's possible they haven't optimized it properly yet.", "time": "5 years ago", "author": "Nedoxu", "channel": "UCk5IvBjbwq3FDmvn0fQdeqg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwXu3K4B9NAWOw2ZO9gpEG9_NtMxUQZa94LqlH3=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughj4l1e4z-T63gCoAEC.7-H0Z7-KG8Y8NoOmZkEPpB", "text": "yeah, two year, in case you didn't, you might want to pick it up again now, it's out of beta, already looking a lot better, it even has its \"Explore the universe to collect 6 pieces of artifacts that will do X\" type of story... not that it's original,. but at least you have a reason to explore the world other than \"because fuck it\"", "time": "3 years ago", "author": "Royal Lumiere", "channel": "UC7hatgmZBZv7MPNu-bCSHOw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyhCVozns-L0oA5Sxlt4mr1_C8rbefZGtYtHoUT=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC", "text": "Abandoneware ", "time": "5 years ago", "author": "ixekun", "channel": "UCIbEy_MbS6H5ja2PdRDQtBg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx_vswNzq93sUgNnJ8hQMws3-QgNfMSl_XQrg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-HHFU5uQlQ", "text": "Like many people have pointed out, that is incorrect. They're working on a single fuck-huge content update instead of a bunch of little ones.", "time": "5 years ago", "author": "Marcus Dranz", "channel": "UCmoKuMxitJnppXJNdNtmgIA", "votes": "9", "photo": "https://yt3.ggpht.com/a/AATXAJwfMFyfwoj93rVET01Q2pjjgZYNarpHa2QiEEj_=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-HlOxbbBz5", "text": "@Marcus Dranz\nThat was supposed to be released in september. They are lying.", "time": "5 years ago", "author": "Welderman", "channel": "UChr3vST8Z1CRJDzMkIfCPxg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyIYbT9lTUhuk9K--jmPR8kpSpIx_cKeXqu3Q=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-HsTdIuOOo", "text": "@BaronCreel\nYou seem remarkably sure of that. On what grounds? I'd say the distinct lack of radio silence is a pretty good indication that work hasn't stopped.\nPlus, they seem savvy enough to want to avoid the backlash the more recent shitheels have gotten for lying and not delivering on promised product, so it's an awful lot of work and risk involved to fake the stuff they put up on the site.", "time": "5 years ago", "author": "Marcus Dranz", "channel": "UCmoKuMxitJnppXJNdNtmgIA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwfMFyfwoj93rVET01Q2pjjgZYNarpHa2QiEEj_=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-HxayZQLuY", "text": "The game was supposed to be finished in 2013, then this year for one. Secondly they were supposed to patch on a monthly basis, they haven't. Finally they promised a major patch in September, of which they never delivered. They have a small fanbase who are their internet defense force, denying this company of any wrongdoing whilst covering for their broken promises. They ban everyone that has legitimate (aka not trolling/flaming) criticism from their forums and lied about offering refunds after people wanted to take them up on their word. They have been nothing but unscrupulous and shady in their dealings and have only survived thus far by being skilled at lying.", "time": "5 years ago", "author": "Welderman", "channel": "UChr3vST8Z1CRJDzMkIfCPxg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyIYbT9lTUhuk9K--jmPR8kpSpIx_cKeXqu3Q=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-HxnSGmTF7", "text": "As for risk involved, the dev for that zombie game got away scot free with abandoning his game.", "time": "5 years ago", "author": "Welderman", "channel": "UChr3vST8Z1CRJDzMkIfCPxg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyIYbT9lTUhuk9K--jmPR8kpSpIx_cKeXqu3Q=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-ICwtQnPOh", "text": "@BaronCreel\nI gotta be honest, there've been enough abandoned games and shit devs lately that you're going to need to point the one you're talking about out for me.\n\nI'll admit that, from how long we've been waiting for this patch, Chucklefish seems to have bitten off more than they can chew. But they're still chewing.\nI bought into Cube World a while back. THAT game is fucking abandoned. I mean, I get it, they're a husband-and-wife dev team trying for a big sandbox-y sort of adventure game, but they haven't just been not adding or changing anything, they haven't been SAYING anything. For almost TWO. FUCKING. YEARS. Again, THAT is what it looks like when someone abandons a game.\nI'm staying well away from the community bit because I learned ages ago that forums are terrible places. Most of them are just well-disguised powder-kegs waiting for someone thick or malicious enough to walk along with a bit of fire.\nAnd that last bit of your post sounds incredibly hyperbolic, and more like you're talking about Garry's Incident than Starbound.\nThey've got far too much to lose, even if they wanted to be as Dick-Dastardly-dishonest as you're claiming, because they're not just a dev team, they're a publisher now as well.\nIt's been a shitty time for games lately and people are becoming far too quick in jumping to conclusions.\nIf you want to write it off now, fine. Go for it. I'm gonna stay right here. So I can have the patch when it comes out and have a good time. ..or be the first one there to slap them if they do cock up.", "time": "5 years ago", "author": "Marcus Dranz", "channel": "UCmoKuMxitJnppXJNdNtmgIA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJwfMFyfwoj93rVET01Q2pjjgZYNarpHa2QiEEj_=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-IHOFOygji", "text": "@Marcus Dranz\n100% this.\n\nMy only response to the people complaining about these games being \"unfinished\" or \"abandoned\" is this; then why the holy hell did you buy a beta game that's currently in development? It's not like that fact wasn't plastered all over the Steam page. There's a certain risk that comes with these types of games, and you have to be smart when it comes to what to buy.\n\nAt least the dev team behind Starbound actually tries to be vocal about their development. That's better than most.", "time": "5 years ago", "author": "Bentendo64", "channel": "UCXj6YD9B47M1cgviqdnNQTw", "votes": "5", "photo": "https://yt3.ggpht.com/a/AATXAJwAo4aA89FReTf7eQdEivPUUbdVx9ZyG2bYyICA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugig1XLrxZBKlXgCoAEC.7-H0Z7-6pbz7-NV15BUot7", "text": "  Also it isn't even out yet. You are just preodering and gaining access to the alpha. You are all one person right? There can't be this many people that are this specifically wrong.", "time": "5 years ago", "author": "Sean Payne", "channel": "UCcMMganFAYTS_eHd6mUt2pA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwPkIQfPEXntEL79kOxG6jgLqRPqwl3zBHD-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugijk9-X7n2LKngCoAEC", "text": "This soundtrack could be one of the game \"Dream\".\nBeautiful", "time": "5 years ago", "author": "Pace The Ace", "channel": "UCAnH6S7KuYnXszy1svlZDOQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyF9SHue_rONmsniUR1K6rz08VrB69y_811l_sM=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghcFAbCAAetpHgCoAEC", "text": "A lot of indie games seem to have soundtracks like this song; calm and enchanting. Can't fault them though, enchanting music is always nice to listen to.", "time": "5 years ago", "author": "Medal Melodies", "channel": "UCnMs6kzfhudtYyn8uNTzIbw", "votes": "7", "photo": "https://yt3.ggpht.com/a/AATXAJzOgDFB_ZFMScT6q9PxuT1zYlaVKJM-4iwsX5jB1g=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjEGdoVc8v-ZHgCoAEC", "text": "This and Stellar formation are my favorite pieces of the soundtrack, (with Vast, Immortal suns as close 3rd, that one sound like a inspirational movie OST track). Curtis Schweitzer did a very good job with the OST, it really matches the atmosphere of the game.", "time": "5 years ago", "author": "Delarius", "channel": "UCKE-bfWWKdf5nX2S5Ge3N9w", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJynKTiVwhJKfELx3cJiqg1O-Dsbvp4LGK_1-7dd=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC", "text": "I wouldn't recommend buying this game, though; the devs have abandoned it some time ago, it'll never be completed :(", "time": "5 years ago", "author": "Nathan Sifferath", "channel": "UCPhGMMlsrVq5o-PcHJT8hEg", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJy0eGc8h0a2FPzLBvY7OVVsxx-CE57xmIJM3OWu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br7-H1n0UJ6pd", "text": "Really? The game's website still seems to be updated. That'd be quite disappointing!", "time": "5 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br7-H2MB8bvzX", "text": "@SupraDarky \nYeah, I mean, the soundtrack is top notch. It really is. But its been so long since the game has had any worthwhile progress. I let it sit for a few months in my Steam Library and just logged in to check if anything new had been updated. Everything was the same. No noticeable changes.\n\nMeanwhile Terraria is getting close to releasing its 1.3 patch which will add so many new things.", "time": "5 years ago", "author": "Staringathesun", "channel": "UCHKjkYJxyy563ZWvOjOnBOg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx7V1ASRtgax-ngE3ivrAVKe-ME0ayMBk7JTg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br7-H2c47uTf3", "text": "Unofficially cancelled, there hasn't been a major update in about a year.", "time": "5 years ago", "author": "Iblobtouch", "channel": "UCGkrBvnOihH87owZmTBJZrQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwRHm4ghSzTjJrX9_v42unBRVu7gpyerXiWJ1Q-ZQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br7-H8S43c2zo", "text": "@Staringathesun I don't think just because they haven't had a patch means they aren't still working on it. The stuff they are working on drastically changes a ton of stuff about the game, so it's no wonder it has taken a long time. I wouldn't call it cancelled until they actually say it's cancelled.", "time": "5 years ago", "author": "Saturn", "channel": "UCjpIFroK5OjoCaUs8Y5UvOA", "votes": "8", "photo": "https://yt3.ggpht.com/a/AATXAJy9gEnaw2e15RVfaIChyRD4vH5nGNVRsUBGqnVLJw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br7-H99oCs2t4", "text": "@iblobtouch That doesn't.... work that way. The reason that hasn't been a major update, is because they are working on the major update. It is a HUGE update, but you can check the website, they constantly post devblogs of their progress.", "time": "5 years ago", "author": "Saturn", "channel": "UCjpIFroK5OjoCaUs8Y5UvOA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy9gEnaw2e15RVfaIChyRD4vH5nGNVRsUBGqnVLJw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br7-HMMqfMVJY", "text": "@CombustingFetus  Hopefully, they'll have that big patch and I'll give it a spin again. I always felt that the weakness of the game is that the content is not very engaging, but it's a game in development so that's bound to change.\n\nIn the mean time I still have Terraria which is the most awesome game ever, so I can wait XD", "time": "5 years ago", "author": "Delarius", "channel": "UCKE-bfWWKdf5nX2S5Ge3N9w", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJynKTiVwhJKfELx3cJiqg1O-Dsbvp4LGK_1-7dd=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br7-HR-vaAj5_", "text": "http://playstarbound.com/category/news/devblog-news/\nthey still do stuff. working on new biomes, food and even improving the mission aspect\njust when you look at the size of their team it's not alot of people working on this so of course it can take some time\nmeanwhile enjoy the mods on the forums. just like minecraft and terraria there is a lot of stuff there", "time": "5 years ago", "author": "Konstamonsta", "channel": "UCcDfDeP2RBQ8qBT84bKgQ_A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz_jN25Q3foDuVsLhs2P3YD3tXiBhtnXh04Kc2f=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br705LA6Tq_d0", "text": "@SupraDarky\nThey are still working on it, just that development has slowed down to a crawl, it's been in \"Early Access\" like that for years with little to no advance. However look at it on the other hand, do you know how many years this game has been in development before being released as even a limited beta or early access? Heck even the kickstarter campaign took ages after the initial start of dev to kick in. I still believe there'll be improvement and development however that it will take tremendous amounts of time considering the size of the team that's working on it. To see a \"Full release\" of this might be a bit too enthusiastic though, but periodic updates will happen and advance will happen.\n\nIn any case, stay tuned for \"Wanderlust: Adventures\" Still by chucklefish (Yeti trunk) with OST by no one other than Chris Christodolou! That one should be released shortly, actually.", "time": "5 years ago", "author": "Sydonai11", "channel": "UCcEiuAAPElu7TQ7hsA1ESEg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyuZQ-45J4gD070kfTkOrP2AvVJqXqNXHTRKA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br70CXbasBk7z", "text": "Oh, you're wrong. They haven't updated in a while because they are working on revamping the whole game. Try out the nightly build. It's \"unstable\" but I haven't got any issues with it so far and it's amazing the progress they have done so far. They seem to be getting closer to what they really wanted the game to be like. Quests, Ship upgrades, Tools 2.0 and so forth are included.", "time": "5 years ago", "author": "AssassinationProject", "channel": "UClmDBlCQugivg0yiZ7G-V-w", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw4Gca8CqUVTDxr0En9OVvyGXNYYIW7zAOgcc8OFQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br71by4_JU2X1", "text": "I hope you all feel incredibly stupid now, as they just had a huge update.", "time": "5 years ago", "author": "Nedoxu", "channel": "UCk5IvBjbwq3FDmvn0fQdeqg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwXu3K4B9NAWOw2ZO9gpEG9_NtMxUQZa94LqlH3=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br71dEIrCcN1M", "text": "@Nedoxu (It only took them since March.)", "time": "5 years ago", "author": "Staringathesun", "channel": "UCHKjkYJxyy563ZWvOjOnBOg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx7V1ASRtgax-ngE3ivrAVKe-ME0ayMBk7JTg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br71da21V_YqN", "text": "Not that impressed, tbh. It seems a lot of the core problems of the game are still their (bad combat system, lack of focus outside the beginning parts). Terraria still seems the plain better choice of the two.", "time": "5 years ago", "author": "Nathan Sifferath", "channel": "UCPhGMMlsrVq5o-PcHJT8hEg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy0eGc8h0a2FPzLBvY7OVVsxx-CE57xmIJM3OWu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br71eAhn_qlDF", "text": "@Nathan Sifferath ... The combat is way better than Terraria's though. It's designed to be harder, which it does successfully. In terraria you either swing you sword, with no recovery time, or shoot arrows/bullets which can easily be hoarded. The magic is the only thing that's good about the game's combat imo. Not that I dislike it, but the combat is a weak point of terraria.\n\nBut they openly said they're planning on adding way more quests and shit to the mid and late game. They wanted early game stuff out of the way first, so they could see if we liked it. I do.", "time": "5 years ago", "author": "Nedoxu", "channel": "UCk5IvBjbwq3FDmvn0fQdeqg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwXu3K4B9NAWOw2ZO9gpEG9_NtMxUQZa94LqlH3=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br8M57b6HUCvD", "text": "Jokes on you! The game is now in 1.0, and is better than ever! It even has a story!", "time": "3 years ago", "author": "Some Polish Guy", "channel": "UCrU_FMvn-b3k_Sl4IM0nZfw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzWx7XMGkRERH_PEVfpG3uKNFRLymdwd_2X3fDC=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiJggY9wKz_73gCoAEC.7-H0Z7-65br8M7VR1lkWFf", "text": "Jesus christ, how long has it been since I typed this out? I legitimately don't even remember. How did you even find this comment?\n\nAnyways, the game is still shit. Look back at the original goals the dev team had written out, and compare it to what the game has now and the years it took to get it to the state it is in now. Incredibly embarrassing, they couldn't keep a simple schedule, and that is the big reason why Starbound is such a half-baked product. Nearly everything in the game could be done better by a more competent dev team (like, say, Re-Logic). I don't know anything about the story, but I'm going to guess it is both unnecessary and grindy to progress through. Tell me if I'm on the mark on that.", "time": "3 years ago", "author": "Nathan Sifferath", "channel": "UCPhGMMlsrVq5o-PcHJT8hEg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy0eGc8h0a2FPzLBvY7OVVsxx-CE57xmIJM3OWu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghM_O_fDg7_zngCoAEC", "text": "Kinda reminds me of the Chaos Shrine from FF1.", "time": "5 years ago", "author": "GoRedskinsAndWizards", "channel": "UCRQ87DNfNKbDSlpQeFkEbuw", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJyEnxHG97r2QNyZSeC9h_sCKGqvISZ13G-glo2h=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghM_O_fDg7_zngCoAEC.7-H0Z7-LcKe71CmpsVJNlE", "text": "Dude, I jut played through Final Fantasy 1 around 4 months ago (Final Fantasy Origins on PSN). First Final Fantasy game since my OCD almost forces me to play games from the first one. I am going to play Final Fantasy 2 next soon hopefully. But when you mentioned Chaos Shrine, I instantly remembered the place and the music! I have not thought of that and I played Starbound back in September last year!", "time": "5 years ago", "author": "GamingNobility", "channel": "UCOVBsLKQkev_c48LIIFn9KA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwVqYebOjCQAWGB71qTS75C3sfd6Hq0A9KnK1Yu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghUdHIeslKCXngCoAEC", "text": "This game has an awesome soundtrack, I'm really blown away by all the great music indie games have been producing. I find this theme enchanting and quite addictive. Starbound seems to be heavily inspired by Terraria, and I like how you have your spaceship and you can explore different planets. It hasn't been released yet, but it's available through Early Access and has been quite popular for some time now.", "time": "5 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "21", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghUdHIeslKCXngCoAEC.7-H0Z7-DTWk7-HTC8tNpLR", "text": "Same devs work on that game", "time": "5 years ago", "author": "Doomtrigger", "channel": "UCnhl1WaB6dNO1BdhR8Zlybw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwKWHoNn_yEeoTaYbhkNO5xD4xqI5bouqylEGid=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghUdHIeslKCXngCoAEC.7-H0Z7-DTWk7-IHTqIvS_S", "text": "@Doomtrigger\nThat doesn't necessarily mean they have to make a game like the one they've made before. As SupraDarky said, this game seems to be inspired by Terraria :)", "time": "5 years ago", "author": "Niclas", "channel": "UCBWCQx_GvDyjJQA2PkRfkhg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzBehqP-B1sTU2uFHf33Et9ZX8omlOWSV4-iqlTFQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghUdHIeslKCXngCoAEC.7-H0Z7-DTWk7-J6DiXtdar", "text": "@nickebest\nRed has nothing to do with this game and the only dev from terraria is a sprite artist and a guy who was fired for lying about what is going to be in the game (Head guy)", "time": "5 years ago", "author": "Welderman", "channel": "UChr3vST8Z1CRJDzMkIfCPxg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyIYbT9lTUhuk9K--jmPR8kpSpIx_cKeXqu3Q=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghUdHIeslKCXngCoAEC.7-H0Z7-DTWk7-J7cLpXNA9", "text": "Is it just me, or has the game industry been incredibly lucky when it comes to hiring composers? Maybe it's because I'm subscribed to a \"best video-game music\" list and not a \"best movie music\" one, but I've heard more creative and inspiring songs come out of video games, even the poorest of them (Tim Follin is relative to that point), than movie score and the music industry combined in the last decade. The bit-music genre couldn't have had a better start. ", "time": "5 years ago", "author": "Jirt", "channel": "UCE-dsUNjcD8hQyiyxfvu2mg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJylkHX8alswF9JDpe2_b5XHqDtkCupgpiqB3wI7=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghUdHIeslKCXngCoAEC.7-H0Z7-DTWk7-PqlKhgpsK", "text": "@Mdude360 I think that's because movie music has to match what's going on on-screen to a larger degree. When a character starts running, the music's tempo has to match that. Video game music is made to be a pleasant tune in the background.", "time": "5 years ago", "author": "Mr Michael", "channel": "UCXgnyquulBxArcTDPqvgzoA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJweHEKbltqY-1Yy4wX_CjQi-QUcBBg5CjNjzg=s48-c-k-c0xffffffff-no-rj-mo"}
