{"cid": "UgjsBXFNelk8dHgCoAEC", "text": "These games are not only amazing, but they are great for a gamer made casual by school/work. I don't have time for MMOs and online games I can pick up and put down as needed. \n\nWasteland 2 was a similar experience, however it was very story driven so it was easy to forget whats going on when you put it down for a while. Shadowrun doesn't suffer from this", "time": "3 years ago", "author": "Beau -", "channel": "UCCRlb-dhXmBz3bJ2-MPaYkw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxx5kecgD6YUBnY327AhVMh3ditFNlHDnM03Q=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghLOY9_dlsp1ngCoAEC", "text": "I just saw Ex Machina. This is exactly what I needed. :D", "time": "5 years ago", "author": "SeriousKano", "channel": "UC5BqsxPn9UBaabhADEha6xg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwqgXMS8nXgVgmQ0fbSJ_MpXaAVF6UlUhbkk1Ir=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjNt9xkh1QN5HgCoAEC", "text": "It was good to see this series return to form while staying near its roots. The difficulty was quite unbalanced and the story was nothing too memorable, but the rest was solid and entertaining. I heard Dragonfall is a big step up, so I look forward to playing it as well.", "time": "5 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "10", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjNt9xkh1QN5HgCoAEC.8-d9427wngX7-H1yMtoYXb", "text": "@SupraDarky You totally need to play Dragonfall! While I enjoyed Dead Man's Switch immensely, Dragonfall is soo much better in every aspect. Characters, story, mission variety are much more enjoyable this time around. The Dragonfall DLC was my personal GOTY 2014 and I didn't even play the Director's Cut yet.\n\nAlso, \"Double Cross\" is probably my favourite song of the Shadowrun Retuns OST, check it out. It's great.", "time": "5 years ago", "author": "Mortyee", "channel": "UCKtbv8I5Pxm-X7an5y99aFg", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJw8fJtYNWRmdzCLOvMcc69ce4n-ROKsS3WY2yTb=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjNt9xkh1QN5HgCoAEC.8-d9427wngX7-HECelcxwj", "text": "@Mortyee I agree Dragonfall was amazing compared to Dead mans switch can't wait for Hong Kong.", "time": "5 years ago", "author": "Teddi", "channel": "UCma_EX0jpCC4iSw8XPamwWQ", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJx11kxCZStoe4c97SEadRGnAUBtRtVHadocA363ng=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjNt9xkh1QN5HgCoAEC.8-d9427wngX7-Ik7bZrGM3", "text": "Hey man, this is excellent timing!!! I am playing through Dragonfall Director's Cut (I thought this Berlin campaign was first, so I played it first) I am absolutely loving this game!!! You definitely should give it a go soon because I heard Dragonfall was better in every way - story included - than Shadowrun Return and it's campaign Dead Man's Switch. I am going to be playing through that afterwards though. Must play all the content!!!", "time": "5 years ago", "author": "GamingNobility", "channel": "UCOVBsLKQkev_c48LIIFn9KA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwVqYebOjCQAWGB71qTS75C3sfd6Hq0A9KnK1Yu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjNt9xkh1QN5HgCoAEC.8-d9427wngX7-It449Wh1p", "text": "@GamingNobility  I made the same mistake, but I'm glad I did I was new to the universe and if I had played Dead Mans switch first I don't think I would have given Dragonfall a chance, but now I am very fond of this universe.", "time": "5 years ago", "author": "Teddi", "channel": "UCma_EX0jpCC4iSw8XPamwWQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJx11kxCZStoe4c97SEadRGnAUBtRtVHadocA363ng=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjNt9xkh1QN5HgCoAEC.8-d9427wngX7-J40FBJv9x", "text": "@awesomemcrad Oh most definitely! I actually first got into the series when I played a demo if Shadowrun (2007) on the Xbox 360 and really liked the cyberpunk and fantasy elements combined in a multiplayer shooter. Too bad I got bored of it relatively quickly, but I still enjoyed my time with it. When I heard of this game being an actual return to the original formula of CRPG and top-down isometric style, I was instantly drawn because I love RPGs WAY more than I do as opposed to FPSs. I am starting to get into this trend of CRPGs because I played Gothic 1 and really liked it, now I bought the Baldur's Gate games and planning to play them sometime this summer. I also heard that Pillars of Eternity, Wasteland 2, and Divinity: Original Sin were really good aswell, so I can't wait to try them!", "time": "5 years ago", "author": "GamingNobility", "channel": "UCOVBsLKQkev_c48LIIFn9KA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwVqYebOjCQAWGB71qTS75C3sfd6Hq0A9KnK1Yu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjNt9xkh1QN5HgCoAEC.8-d9427wngX8DxVbyE9e-k", "text": "+SupraDarky Im just necroing this to say Hong Kong is just as good (maybe better) that Dragonfall, the series kept the quality", "time": "4 years ago", "author": "kionashi", "channel": "UCIPL48VCPwCOyri8TIi4RSA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJygzoEOLf9iuBjHZrDh2muyd85LhbiSGgJvrpk1=s48-c-k-c0xffffffff-no-rj-mo"}
