{"cid": "Ugy6kdhiGgpEf9Uex0p4AaABAg", "text": "I took the green one too!", "time": "1 month ago", "author": "El Jugador Escaldenc", "channel": "UC3YcUqBUIxsz6h0Tl836GVQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzB1ttUTL7Cwyrkcj5B05l_ai88Xo622sR9ubRXFw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzKVcJMuxo5tBThUM54AaABAg", "text": "1. Infernape (3rd), Grovyle (2nd), and Hydreigon (1st)\n2. Pokemon Platinum\n3. Hate them all.\n4. I like where they are going with the series\n5. Either Pokemon or Persona", "time": "2 months ago", "author": "Brenton Taylor", "channel": "UCYlc-qjoP6bchfcwVzFVW-A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzWT6cP58nSupjzBflEsMnOVPY5RjjgFYXhIg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyAQ_y4Q4MIGAhXbfR4AaABAg", "text": "1. Lucario, Charizard, and Greninja\n\n\n2. Diamond/Pearl/Platinum\n\n\n3. they have never interested me to much but I mostly agree with you.\n\n\n4. yes and no. I want them to shake it up some more but I want them to give me the feeling that pokemon pearl gave me.\n\n\n5. same", "time": "1 year ago", "author": "Mojojojo X", "channel": "UC72WlzOcUwMJEjR8qxZcHWA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxALUxwgN9fVVzCcXaRItwwfSqqLCq4UNx8-HgV=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugz73tT81JEE-sy4Eat4AaABAg", "text": "Gengar is still my #1!!", "time": "2 years ago", "author": "StevenTravelCaptainRogers", "channel": "UCICgh48ZTAz0eBo49IlVXCA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx0sUdxk697rS5VnioXPyc-wczPPFq79TNuktGC=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjRM7ctUPVgdHgCoAEC", "text": "The fact you chose Bulbasaur makes you #1 in my book", "time": "3 years ago", "author": "Arthur Dorr", "channel": "UCyYh-7bxYyyvcKrDiV-NpuA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyKcJH7rFdA-xTVWsUQbmsAdHuDwVzhnmgASA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UginkxPT7ukBQXgCoAEC", "text": "1. I'd have to go with Banette, Deoxys, and Chandelure.\n2. I'm honestly not sure. I might get some crap for this, but I did really enjoy Alpha Sapphire. I didn't play original Sapphire, due to not having a Game Boy.\n3. I am very fond of one particular Pokemon clone: Yo-Kai Watch. The connection to Japanese mythology was simply too hard to resist.\n4. I am very happy with the way the series is evolving, and am excited for Sun and Moon!\n5. Most likely Pokemon, or Yo-Kai Watch. I love a lot of other universes, but they seem far too dangerous for an average Jane like myself.", "time": "3 years ago", "author": "The13th Rose", "channel": "UCjxA4M54pfE_QFfLpCbZlyQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzxVXeI5TrolNCmguCtTCm6aYNeatS8JiIqT2sE=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiqWqN5fPOetXgCoAEC", "text": "Here you go - Couldn't expect the Pokemon Go hype yet", "time": "3 years ago", "author": "coherent911", "channel": "UCCj3BBJGr9r4Ao0B3VF11Ag", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy8cndxU2pGvcXXRH-CdLHxfqU5yk382EMBx5Ao=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghkIzkTxGZ4T3gCoAEC", "text": "1. Gyarados, Camerupt, Honedge.\n2. Pokemon Ruby/Saphire/Emerald\n3. Ni no Kuni come to mind.\n4. OmegaRuby and AlphaSaphire seem to be great, but it could be the nostalgia effect because i played ruby on the GBA alot.\n5. Not way up there, but surely in the Top 20.", "time": "4 years ago", "author": "Griflion", "channel": "UCtJzVgoqZC0QH1TyZK1VN3A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyi_LGNukWw_NpBqDQYRZGwtLEuKIEP_gVAQxz3vg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiXheDNm55z-HgCoAEC", "text": "1: Typhlosion, Manectric and Suicune\n2: Gold/Silver/Crystal\n3: Actually never played any, save for that awful Animorphs game. Though I kinda disagree on Digimon being a Pokemon-clone, though. After watching a lot of the anime (and playing a little bit of the games), I get the feel that they're trying to do different things and in different ways, so I don't feel comfortable \"labelling\" it as a Pokemon-clone. \n4: X/Y was really, really good, but I still want something that feels...bigger, somehow. Probably just me that's getting old, though. I'd also love to see something a bit darker that'd feel like how G/S/C's Rocket-scenarios and Colosseum felt like when I was a kid. But again, age. : V\n5: Gensokyo all the way! On that note, please add some Touhou-music to the list! : D", "time": "4 years ago", "author": "LordMyoo", "channel": "UC-sJdDVqIdMsgVycZ3UYZOQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxURZYHVJ-gMaSXjDPD3sGRKeyNB5zA--nVuQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiRYVnIlMg7s3gCoAEC", "text": "Favorite Pokemon?\n\n\n\n\n\n\n\nUHHHHHHHHHHH", "time": "4 years ago", "author": "JimGio", "channel": "UCuP3IFcRWK1LGwSj4HlxNqA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzmwInSW18Nx56CaH7lUQQg9C7zi7MAIfPsgTvUQQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggVYs5o9sFDDngCoAEC", "text": "Typical underground Genwunner.", "time": "4 years ago", "author": "Gatomon", "channel": "UCXjQvN5IOVeebQ1flSoRgjA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyaFM5_3riiY-xyzptMtGSxzaT2WCulD-_R5ts61w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghyDQqepnCnp3gCoAEC", "text": "1. Sandshrew, Piplup, Lucario (but I could easily end with a really extense list...)\n\n2. Heart-wise, Crystal. Brain-wise Diamond/Pearl\n\n3. I don't think I've ever tried a pokemon clone as such, but I love it when RPGs have a small pokemon-like game embedded (Azure Dreams, Dragon Quests V and VIII, Tales of Symphonia DotNW, Ni no Kuni...)\n\n4. I haven't tried last generation, but I really liked how they broke the split of Physical-Special among attack types! I think this gave the game plenty of new possibilities!\n\n5. Haven't thought of it. But having some pokemon pets sounds appealing... who knows...", "time": "4 years ago", "author": "Carlos Pozo", "channel": "UCYNRw5m03FmxV1g19svOatg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwQ3cgS6auFSWWWBDp-ZXWDZcQDDAfv8Ou4SIzA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg2LIa824un3XgCoAEC", "text": "1. My top 3 Pokemon are Gardevoir, Lillgant, and Espeon .\n2. My favorite Pokemon game is Black and White.\n3. I like Digimon it was really good however personally I think Tamers is the only that I really liked out of all of them.\n4. X and Y did really need to change it up Story wise I think the addition with Megas and fairies where good it just need a great story like Black and White. \n5. The video game world I would live in is defiantly Pokemon and the reason I say that is not only because it's Pokemon. It's that you can have journey with your friends in that world. Just think with your friends along side you traveling the Pokemon world that just sound freaking awesome!", "time": "4 years ago", "author": "Darknile", "channel": "UC9iJ2ZpgwvDP5tFuWW2BvKw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyoelFZBStJbAWkz5aIpmR98gLp8jlXM2BWU2mtsA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugj8aV0H0hkDWngCoAEC", "text": "Junichi Masuda was a goddamn genius. I've yet to hear a Pokemon soundtrack that lived up to the original excitement and novelty contained within RBY. I was never big into these games, I've played through them a couple times, never owned them. But the soundtrack from the originals still get me. They rock! For as simple as the hardware limitation was, it's incredible he composed such awesome emotional effects.\n\nI agree with pretty much all your thoughts in the end there. I loved Zapdos. And there definitely needs to be more innovation with these games! I can think of a dozen changes that would make me want to play it all over again. Probably the biggest challenge now is that they have so many Pokemon now that if they tried to render them all in 3D and give them realistic motion, it would take an eternity even with a big team. And the game would be massive.", "time": "4 years ago", "author": "ShadowKinesis", "channel": "UCixGvs6hlCxd8ElBUzFptQA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyKNp7Wo_kCFqauEjMP7D9dMueuUNMixXBseNTG=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugha9Qw9I8CpcngCoAEC", "text": "Scizor, Houndoom, and Charizard", "time": "4 years ago", "author": "darqetsu", "channel": "UCIOizmdEtiUvG2QN3hDtw5g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxEe3Z_yQjxSNZKc_zDUCUx3L6nfsKuiJlAdg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg17mDLDJ-9HXgCoAEC", "text": "1. Ninetales, Jolteon, Nidoqueen/Ho-oh \n2. Gold, Silver\n3. Don't really see them as clones. I like Digimon for its differences and not for its similarities. The relationship between digimon and human has a lot more to offer than its pokemon counterpart imo. I like the Digimon Anime (Season 1 and 3) a lot more than the Pokemon Anime. I also liked Monster Rancher. It was overall quite dark.\n4. totally agree. I lost my fever for the series with the fourth generation (needs more regions in one game again).\n5. Top three I'd say.", "time": "4 years ago", "author": "ThiefSakon", "channel": "UCOyasB_tZEItBJ8UKrlh8Fg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzKo_5kdv48bjN063GEapel1VfFaUakb1jskBRy=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgieKCbK255reXgCoAEC", "text": "1. I always liked Mew as a concept, but I gotta go with Squirtle, Growlithe, and Aerodactyl.\n\n2. Silver, Red Rescue Team, the TGC video game.\n\n3. Enjoyed the first couple gens of games, ducked the show, movies, merch, etc. Got into TCG awhile.", "time": "4 years ago", "author": "Tony TheTGR", "channel": "UCCfyXagKXV5B1QycJQnVhUw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzRD19Zfzu_-145YRrrqfGDysadUp83e3hsMMlmSg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgieKCbK255reXgCoAEC.84ZDaZglv_w7-H1baFjJNI", "text": "I guess that would be 4, huh? Never got into the wannabes, though I did like the creature sidekicks of Final Fantasy Legend 2 and 3. It was kind of similar, and mutating them enough led to some powerful sidekicks!\n\n5. The PokeMon experience of this world is real enough! I\nSome days I'd like to live in Super Metroid or a 2D Zelda.", "time": "4 years ago", "author": "Tony TheTGR", "channel": "UCCfyXagKXV5B1QycJQnVhUw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzRD19Zfzu_-145YRrrqfGDysadUp83e3hsMMlmSg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiYZk5ahUomJXgCoAEC", "text": "1. Sceptile, Aagron and Squirtle\n2. Ruby, Sapphire \nand Emerald\n5. Zelda\nCan't be sr\nstuffed doing the other ones.", "time": "4 years ago", "author": "Patrick Clement", "channel": "UCg6LQPSH3geygBgW1RLfZaw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxKF4LmWnmErzy1O9N8q8MUkqdTr-IJGBQbMw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi0PtQzv-UMU3gCoAEC", "text": "1. Way too many to have a solid top 3. 2. They all honestly feel like expansions upon the same game (and that's not necessarily a bad thing, more on that in #4). But I have to say the best main game structure is Platinum (all new, non legendary breeds available before postgame), HG/SS B2/W2 had the most robust postgames, and for sheer availability of breeds (especially if you like catching legendaries), OR/AS can't be beat. 3. Often imitated, never duplicated; but if you ask me, especially considering their depictions of the \"mons\", they all feel like the proverbial oranges to Pokémon's apple. 4. Short answer: If it ain't broke, don't fix it. Long answer: it's definitely better that they don't try to shake the formula up so much it feels like a whole different world or a whole different game. When new games are announced, what I look forward to the most are the new breeds, and the potential for new type combinations. Just give me those, and I'm happy as a clam. 5. Haven't really thought about it too much, but an offhand answer would be the Mario universe. I'd say Kirby, but way too many Eldritch Abominations and Cosmic Horrors to worry about. (Maybe the Panel de Pon universe).", "time": "4 years ago", "author": "EvilMariobot", "channel": "UCty7OjBtLnprSfl2MqRA72g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzQInx8dSAoXO2fgLwt-MZxRffHI3lJc6s9aiB7=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgglpmAqYJ6GwXgCoAEC", "text": "1. Far fetched, jigglypuff and cacnea\n2. Pokémon Gold (I played it for over 11 years)\n3. I have never played any of them...\n4. I stopped playing the games after Crystal. The only thing I know about the new games is what the pokémon look like... A trashbag? A candle? An ice cream cone? A key chain?  ...no comment.\n5. Pokémon, without a doubt. I've \"lived\" in Jotho for 11 years, so it kinda already was my second home.", "time": "4 years ago", "author": "HathiFan", "channel": "UCdlNbuA20xPtAbjbMX6PHwQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyqWaRd-BINbtL9uL3iAzbn6Cq8RoEkWSI-6NkL=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjtHJ0JfIYys3gCoAEC", "text": "Oh man. Pokemon was my childhood, especially back in the R/B/Y and G/S/C days. I remember fondly when Pokemon blew up near the beginning, and everyone watched the show, which was great. I'd say the franchise fatigue is most apparent in the show, and as for the series... the games don't feel as fresh as they used to. Yes, a lot of major changes have now be geared towards the PvP scene. \n\nBut I do give credit to Black/White: Those games have quite an in-game story that's very different from what you'd expect in Pokemon. And yes, I believe they take it to a new level that X/Y didn't reach when it comes to storytelling.\n\nNow for the questions:\n\n1. Charmander, Houndoom, Cyndaquil\n2. Gold/Silver/Crystal (I've played those games countlessly... yes I've played them all, even if I didn't need to :P)\n3. The Digimon show was cool. Interestingly, my parents said Digimon was incredibly violent, and that I shouldn't watch. I mean, okay. Digimon die, sure. But still. But that's all when it comes to Pokemon clones.\n4. Like I said before, I feel like a number of changes to the series have now been addressing the PvP meta-game. When it comes to the game itself, Black/White and X/Y provided some big aesthetic changes, but overall, I feel like there need to be bigger changes to hook me. As it stands, I'm not too crazy about the idea of a potential Pokemon Z with this apparent staleness now\n5. I used to want to live in the Pokemon world, with my own Pokemon, going on my own journey :)", "time": "4 years ago", "author": "myohel0", "channel": "UCQ5WJOBP-SNuHtZkLg3KVuQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxOjRkNRLmR4EXTsUuSpoTCR8eqCKUQtkHf_AKiQw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghGGEYdeexJjngCoAEC", "text": "1. Uhh I have way more than 3, so I'll arbitrarily pick Zygarde, Kecleon, and Tropius.\n2. Fffff uh Fanmade: PTU, Main: HG/SS, Spinoff: Pokemon XD\n3. I prefer the term \"'mons game\" and... I really like the idea, so I'm not opposed to \"copycats\" provided they add something interesting to it. A lot of games just throw a new coat of paint on Pokemon without making a battle system as complex or interesting, and I don't think that does a service to either. Beastie Bay is an example of a game taking the 'mons idea and doing something novel with it, and I'm a big fan.\n4. Yes and no. I'll probably keep buying it. But after playing Pokemon Tabletop... there are so many places they could go with it, but they keep following the formula because it's easier. I wish they'd make more spinoff games and take it different directions.", "time": "4 years ago", "author": "Sayeth Di Puppeth", "channel": "UCQgLAk4SlgUodNwnrf5NsGw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyJ4kkJgRqSPl7DxXLeogOY19G-uRYFIqnPzQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggD29B55P3zuHgCoAEC", "text": "Pokemon just has a nice feeling about it.\n1. Espeon, Umbreon, and Zapdos (so hard to pick)\n2. I love the red, Ruby and Colosseum games the most.\n3. I was into Digimon but not as much as Pokemon and Yugioh (I also liked Beyblade if that counts.)\n4. I agree with you on this one.\n5. Lol\n\nBtw I just love the music of Pokemon! Especially when orchestrated.", "time": "4 years ago", "author": "tija1012", "channel": "UCnzt6ISSQYW5R6ET1oU-S0Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwjdlN5c-ZXprPxD_eljWHGGDrsh87eJAhvSbDsNQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghtZoBTyWdYsngCoAEC", "text": "1. My top 2 are Charizard and Gyarados. I'm not sure what my third would be, but I also really like Gengar, Scyther, Mewtwo, Weavile, Lucario, and Kabutops, to name just a few.\n2. My favorite is BW1, with HGSS close behind.\n3. I never really played any.\n4. Since the first Pokemon games I played all the way through were LeafGreen and Platinum, I can't really say. I do like how the battle system has changed, and I like how the more recent games, especially BW1, have a bigger emphasis on story.\n5. I would also love living in the Pokemon world.", "time": "4 years ago", "author": "redgyrados2000", "channel": "UCYSg4Q7kBLkp2P_PcR5Fyyg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwY0ZwcuZENYhfWi5_3tg9NHfIG3zXKYI_www=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggwfmU5mc8LkHgCoAEC", "text": "1. Charizard, Mewtwo, Primeape\n2. Gold/Silver/Crystal\n3. The only Pokemon clone I've played is Jade Cocoon, but I'd buy an Xbox One if it meant being able to play Jade Cocoon 3, and if Jade Cocoon 3 turned out to be good.", "time": "4 years ago", "author": "Link8150", "channel": "UCV8OfsxRIcrnjL4UobaUw_Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxQa_t3B1iMtjXJu9pfXeinrGDimq-RBOah_WwL=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiDkyoV_vjVeXgCoAEC", "text": "Great to see you back after such a long wait. Finally you do the pokemon 100 video which I've been expecting for quite some time.", "time": "4 years ago", "author": "TheBirdftw", "channel": "UCv8OJyqEwEG7IicCpZo9khA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyx03hPSjG5p5eyarJvWBmd_7PzmUsh-VLfIRi7=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiXRX8jNihGBXgCoAEC", "text": "Welcome back!\n\nBack then I only played pokemon yellow and watched the first 2 seasons of the anime, before noticing every season was exactly the same, only changing the \"pokemon of the week\". Also played pokemon snap and stadium and always wondered why they never made a full fledged, high production value pokemon RPG for a home console.", "time": "4 years ago", "author": "Claudio Marcelo Basckeira", "channel": "UCYrnVJ_3jWOt5TfqGhuZeng", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyJmdEIM4v0DR6xaTJFOBSpeCVHOWSlSd9L7STgOw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghnMstX7B4OIHgCoAEC", "text": "Awesome stuff! I actually WATCHED your video :p", "time": "4 years ago", "author": "Everlasting", "channel": "UCDHOvIAGkmzwyNHubIn2o2g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz78DGUd0H8cMyNn3MQWiliLVfRQX9MhxWUwCon=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjgxIYACV4sWngCoAEC", "text": "I was another one of those who got one of the limited Mews on my Red Version! Still have the cartridge with the sticker on the back. Almost twenty years later, it makes me smile.", "time": "4 years ago", "author": "Kevin Murphy", "channel": "UCActVIUsKU3vC3mlhlmEZQQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzRE_MWu5k_DObw7Gl9oorBCj3K6ID_SqhQhIbt=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg-UOwG1RgPLngCoAEC", "text": "Favorites: Larvitar, Bulbasaur, ... i dont really have a third. Those are my two\n\nGame: Gold/Silver\n\nClones: I liked the digimon anime more, otherwise I didnt care for any of them much.\n\nEvolution of Game: While I play and beat each game, I do feel they are getting stale. Megas were cool, but not a big enough edition to keep the franchise going imo.\n\nWorld: Probably Harry Potter or Pokemon. Cant think of any others that I would REALLY want to be in.", "time": "4 years ago", "author": "Jared Silvestri", "channel": "UCbnxVUdMLpDyloSc0_vP5jA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzLLo_npixcUue0c6ns3w8l5JsFtm8VKzz8c-zOaQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjtBcdSkTuRCXgCoAEC", "text": "I think they may be testing, with Pokemon Go, the start of what may be a much more expansive idea of Pokemon. Imagine mobile VR/AR with Pokemon Battles across the whole IRL world? In person and on network? Against other people and against generated NPCs? With a storyline fitting to your location? Technically this could all be possible in the 2020s.", "time": "4 years ago", "author": "Malcolm Swoboda", "channel": "UC_gZtTfxAtuT72Ode5jcwpA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJykcVb9I1zYH5X17FFyFDZoC5ifYSni7HyeO1VoTQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugio_UV1uL6go3gCoAEC", "text": "1. Gyarados (it wrecks everything when it gets angry), Charizard (it's a friggin' dragon), and Drifloon (dragging kids that grab on to it to the Pokemon equivalent of Hell is incredibly metal).\n\n2. Gold/Silver/Crystal. If I had spent more time playing Gen 3, I'd go with Ruby/Sapphire/Emerald, but I only played them so I could get all the Pokemon for Gen 4. Diamond/Pearl/Platinum had a lot of cool stuff but the battles dragged s-o-s-l-o-w-l-y, and Red/Blue/Yellow was broken battle-wise (Alakazam and/or Mewtwo = you win). I haven't played Black/White or X/Y, but now that I'm finally planning on getting a smartphone, you better believe that I'm going to spring for Pokemon Go.\n\n3. I haven't played any of them, but as far as I'm concerned, they're all cheap knockoffs of the real thing.\n\n4. Yeah, I'd say so. I'm not a fan of fixing what isn't broken, and Pokemon adds enough in each generation to keep people engaged while not changing what makes the series great.\n\n5. Damn right I'd love to like in the Pokemon world.", "time": "4 years ago", "author": "David E.", "channel": "UCJNsvh33KhHeROeelPRtbEA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzcqXIZ8lDIxJJB9wEi63195Z14bknK7aLhyqJyog=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghpzzED3XENVHgCoAEC", "text": "1. I'm one of those guys who always change their favourites, because there are so many likeable Pokémon. That's part of the series' charm in my eyes :)\n\n... Though I suppose Treecko, Murkrow and Mareep are a bit closer to my heart than the rest. If I push it.\n\n2. Ruby/Sapphire/Emerald \n\n3. I actually watched far more Digimon than I did Pokémon, mainly because Digimon aired later. I didn't start thinking of it as a clone until in my middle teens :P\n\n4. I lost interest in the main series after having played through gen 4, partly because I didn't enjoy the 3d graphics, and partly because of franchise fatigue. I do however fully understand that there is a never satiated market and competitive scene demanding their annual update. As long as there are spin-offs that explore the concept in new (more or less) interesting ways I don't complain.\n\n5.Oh yes, without question. Especially if  100 new Pokémon kept pouring in every year!", "time": "4 years ago", "author": "Terraflyer", "channel": "UCaYbATiqEqbCGOKfbu5vcLA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzYXHAe58-U0EMiR36y7qNa-Vqp19nyt0_IREjR=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjOx--JQu8IEHgCoAEC", "text": "Really enjoyed the video as it was nostalgic for me too. \n\nI only played up until Ruby Red/etc. (last games on GBA/SP?). \nFavorite games in the series were probably Gold/Silver.World I'd want to live in: Uncertain, but Pokémon wouldn't be too bad. It would probably have to be a Nintendo-game world as I imagine they would be more light-hearted and relaxing!", "time": "4 years ago", "author": "Renphalos", "channel": "UC8TMc7H2e81qvDhv6l9ZicA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx2hfCuWHTSpDrDgaHu9qhmRRCLgKRXW7Ws2TB2=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghU2Z2mrsbwqngCoAEC", "text": "ARGH! The plural of Pokémon is Pokémon! Not pokémons!", "time": "4 years ago", "author": "iquitelikecats", "channel": "UChI3Qp5639Uxp8dObdnup2g", "votes": "6", "photo": "https://yt3.ggpht.com/a/AATXAJxKIcJnmrG73g8hvFun-UaU9VztkDQ6_w8ejXZa=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjKx1IQ0-dpkXgCoAEC", "text": "1.- Charmander, Scyther and Pikachu.\n\n2.-Pokemon Fire Red (Was the first game i play serious)\n\n3.-I like Digimon a lot booth games and anime. Jade Cocoon was boring for me.\n\n4.-I am not happy at all, i would prefer that Ash get old with us, maybe another main character who was following the philosophy of Ash and not so many pokemon.\n\n5.-Pokemon will be great, but i must confess that i also had thought about Yu Gi Oh and Harry Potter.\n\nIt is great to have you back, i am following you since a lot of years now, i am happy that you build this community of nostalgia, greetings from México :D", "time": "4 years ago", "author": "Juan QC", "channel": "UCX6K0hd11l8zHDyhFjact5A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx6ckfBL7wQ85iCWsOKmdbUOj2GX5BGeW7EUR6Bmw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugij4n5__CT3jHgCoAEC", "text": "nostalgie!!!\npokemon red,yellow,crystal ,  how many hour spend in it, too much....\n\nnice song", "time": "4 years ago", "author": "Lunolux", "channel": "UCKOrhRFgfgwxLDfDe6lNEeg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz4hW_GRP_ESzLzL5LvVia8QzvnYjNJU8soKg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghLN8ysX_3NAHgCoAEC", "text": "Nice seeing you b!\n1.Goupix, Absol, Registeel\n\n2. Hg/silver ,Black and White\n\n3. Had fun with Dragonquest monsters others where to vague for me.\n\n4. Yeah same opinion here.\n\n5. Unf that's a hard one! FF9 universe comes in my mind.(even thou there scary monsters there lol!) I would love to live in the shinmegami tensei universe(if i weren't a weak puny human..i don't want to end as demonfood or something worse!XD)", "time": "4 years ago", "author": "212madfool", "channel": "UC0KFFoP0-TWlmfriVfhUDKg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz6UueJtvvhwqzMYWSaOyA0yELjdUk3y8TqvWiZgg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg3NXzT8hEUR3gCoAEC", "text": "1. Dragonair, Eeveelutions, and Scizor2. Gold/Silver(specifically HeartGold/SoulSilver)3. Same thoughts4. I like the series as is, but yes they could do some things to shake it up a bit more.5. Chrono Trigger, though Pokémon is crazy tempting as well.", "time": "4 years ago", "author": "Arc13", "channel": "UCRnY0rfgSJss0ObBuQciNEA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwEHbUhQ-89rVBAtMDkWRiBH21XbJHnST8Zm6SF=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghEMvXEfOGfQngCoAEC", "text": "1. My 3 favorite Pokemon are Bulbasaur, Sceptile, and Pikachu.\n\n2. My favorite Pokemon games are Fire Red and Leaf Green. I've played every gen and really enjoyed Platinum, Emerald, and X and Y, but LG and FR are the ones I always come back to (and have had multiple save files go over 200 hours cuz I'm a crazy person)\n\n3. I really enjoyed the original Dragon Quest Monsters on Gameboy Color! Other than that, I've barely touched any of the clones (though I did enjoy the Digimon TV series)\n\n4. I'm somewhat happy with the way the series has grown, but I don't like how they tend to drop great developments in new games (secret bases disappeared after R/S/E (aside from the remakes), customizing your character only in X and Y, the day/night cycle even has disappeared and then reappeared). I get that they want to keep games unique, but when they drop great developments in the next game, it feels like two steps forward, one step back. \n\n5. Pokemon would definitely be up there. I'd also love to live in Skyloft, or the Skies of Arcadia world.", "time": "4 years ago", "author": "Tadpole Superhero", "channel": "UCaxEpWeHc6UEgkMbot4B_sQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw3mIj5ia2AvLBma0HfqMgB79LXrs3PauqYfwX-=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghVNk_18fWTCXgCoAEC", "text": "Digimon is not a Pokémon clone. The anime was better and actually had a bit of depth. The Pokémon games are much better though.", "time": "4 years ago", "author": "dbzrules95", "channel": "UCNWBtxumi9OB5_hdmd9qVAA", "votes": "4", "photo": "https://yt3.ggpht.com/a/AATXAJyShFey6GfYnsP2fbKry83m36pNria3pnR89FVjeg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ughmd-Lg__fywngCoAEC", "text": "Welcome back!!\n1. Charizard, Onyx, Charmander\n2. Same. Red/blue and yellow \n3. I don't mind them. I haven't had any experience with any of them outside of watching the Digimon cartoon and having some trading cards. Still, nothing beats Pokemon.\n4. No. But I haven't liked the series since they introduced all the new Pokemon after the original 151. The originals were cooler and more creative IMO.\n5. Pokemon would be a great world to live in! Other than that?....wow... tough question! I'll just stick with Pokemon.", "time": "4 years ago", "author": "daneofurexistence", "channel": "UCh3jESXr3-xqo_sJ3I1qgUw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz4J37T2K4_VQMpT9C_Qwkl87RTioz3bSRqb78=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghTyj6Cfj0V8HgCoAEC", "text": "Im following since VGM ~200 and still listen to your lists during work. After your announcement I was afraid that u would be gone for ever. Glad to have you back, keep up the good work, you rock!\n\n1. Turtok (dunno the english name sorry, lvl3 shiggy), Mewto (badass) and Gengar (crazy devianarts out there)\n\n2. Red/Blue/Yellow, i actually never played one of the following generations except Rubin and found it a good remake but it was nothing really new so it did not fascinate me as the first ones when i was a kid. When i think about it I guess that the only reason why I playded one of the newer games was because all the Smartphone GBA Emulators came up around this time and everyone in class was playing pokemon on their smartphones :D\n\n3. I liked Digimon on TV and had a game on Playstation One but never really had a great interest for the 'clones'.\n\n4. Im not too much into console gaming so I dont really care about the series evolving tbh.\n\n5. Hmmm i dont know, think the pokemon world would be to color and cheerful for me. And also in the pokemon world its not you performing all the cool stuff and its not really the character who is powerful but his pokemon, so I guess i would prefer another world^^", "time": "4 years ago", "author": "Rizource Avo", "channel": "UCh6-ShfpHYDSCusxZW5EpqA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwImfCTngv5SFNXtWg2kukWGvTR1MsGGTT8m4T8=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiFPgnImOl0qngCoAEC", "text": "I already live in the Pokemon world m8. My dog won every match so far! /s", "time": "4 years ago", "author": "Igeljäger", "channel": "UCWF5KaKXvl6NNoUGq7gmfCQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzuz8KIoWHFBOtkRmwdTGILEtRzJvDyZ38vTlBsVg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjeO-Yj8MzELXgCoAEC", "text": "Great video, I loved it", "time": "4 years ago", "author": "Vidyagamesnake", "channel": "UCB3bn-SXM7wsQu8BfvPDzuA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwnLtoOhRNvZgOlDcqOYJeauBddgAMwT9UoxfCc6A=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghYP255Hu4fYXgCoAEC", "text": "Woooo!\n\n1. Squirtle, Ninetales, Gengar\n2.Silver\n3. Don't care\n4. I'm ok with it. Don't really play too much anymore. Last played Black\n5. Yes The world of Pokemon seems really nice to live in. There is lots of variety.  But I think if I got to choose I'd want to live in the world of the Persona series.", "time": "4 years ago", "author": "boyblob", "channel": "UCfEjfPJ-Nhs5LJ8C23fvEpw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwKAckB7G6ALBCtWecMNM-KIT3pshPF2HVoke1v=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghAAfDIio1NG3gCoAEC", "text": "1 : Mewtwo, Greninja, Feraligatr\n\n2 : Gold and his DS remake ^_^\n\n3 : Never playing so i have no thoughts x-D\n\n4 : Not really, the core of the story is basicelly the same at EVERY GAMES. And that's why i quit playing this serie after the 2nd gen, i only return to the saga with Heartgold (Gold DS remake) and play Pokemon X (3ds sold with the game): But that becomes boring to make roughly the same thing in every games.\n\n10 years old child have his/her first Pokemon, some creepy old professor give us a pokedex with the mission to \"catch em all\", 8 badges to collect + 4 great trainers in the League of the region and the Master at the end, we have a rival who aims to be less and less charismatic at each games since the 2nd gen, a random villain Team, the Pokemon are the ONLY FRAKKING THINGS matter in this world they are no others things above ! (it's like a religion) It's as if in our world the only interest would be for example a competition of tickles and that we would have built a society turning only around that.\n\nI think a complete new story core will be refreshing.\n\n5 : I don't know too many choise @_@\nDo the hentaï games with a harem of hot girls count ? X-D", "time": "4 years ago", "author": "eternien", "channel": "UCDDYsqUVqwXeElxh8PZhAdw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy20vHaRCNI7DhSK7UExgHP6_jCKidrqcVBYF2l=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghAAfDIio1NG3gCoAEC.84RXH_dQN857-NF4Hyn1G6", "text": "+eternien Lol @ your #5 response!  ... But yes they do count good choice ; p", "time": "4 years ago", "author": "xSayPleasex", "channel": "UCtU-V-Sncad2nwEwxs51uuQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxmGOfkaE1c4j-qaIXAz-EsQYvMhI2P1q5DBDb_=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjWO9DpEZelJngCoAEC", "text": "Question 1: METAGROSS, Rayquaza, and Salamence.\n\nQuestion 2: Emerald.\n\nQuestion 3: I don't really care.\n\nQuestion 4: YES! The series may become boring to others, but Game Freak are really making good decisions on their part to make their franchise even bigger. Heck, even next year, they're making Pokemon GO, which is on of the most innovative things that a game could become.\n\n\nQuestion 5: Pokemon, Tales of..., or maybe the Mega Man world.", "time": "4 years ago", "author": "Zedrik Allen", "channel": "UCGFFY93Ms9dJZ46MpbBi6Yg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJypBxM65Y6G1V8dn1BWjknf4bAjLDcZxzyfUVH3Jw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg-oCoCAO7Sd3gCoAEC", "text": "1. My favorites... Not easy now that there is more than 700... I'd say Mewtwo, Yveltal and Gengar... No particular order\n\n2. X/Y, because it made me reconsider playing Pokemon after giving up on 4th gen. I even played Black after finishing X/Y ! (and I've got 719 Pokemon on my Y version)\n\n3. Never had the occasion to try one.\n\n4. Yes absolutely ! But I'm feeling like Alpha/Omega was this big sham \"Yay more mega...\" when it could have been made for X/Y and have something really new...\n\n5. Definitely the world I would like to live in. I mean, yes there are other universes cool and all, but Pokemon would be the kind where anyone could prove himself by fighting with gigantic monsters... or tiny beasts that actually hides a lot of power ! And I wanna be the very best...", "time": "4 years ago", "author": "Aganhim", "channel": "UCgypARaIGvo3wLjOFeyKtMg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzFd8srXuAwQA_wWBqmY5PLFNP5JDJ3O1m7zU5J=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiPArRxtuqp53gCoAEC", "text": "My internet connection is so bad, I'm writing my comment while loading the video, and I already liked it. (because Pokemon guys !)", "time": "4 years ago", "author": "Aganhim", "channel": "UCgypARaIGvo3wLjOFeyKtMg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzFd8srXuAwQA_wWBqmY5PLFNP5JDJ3O1m7zU5J=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Uggqqj5l5-LPCHgCoAEC", "text": "1) Skarmory, Escavalier, Politoed. \n2) G/S/C and by extension HG/SS. \n3) never played them\n4) A controversial opinion, but I think Pokemon should just stop. There's too many Pokemon now, a lot of them just look stupid now. It feels very much like a cash grab every time a new pair of games come out. \n6) I would like to live in either Pokemon, Elder Scrolls or Star Wars Knights of the Old Republic world. Oh or freelancer.", "time": "4 years ago", "author": "ribena", "channel": "UC6QyBiJGMRzebDZerE6GbmQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxbNXVHnR3ZK-ASPxNtAq7QSWU6tQdUzxtDYzov=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiX_7UTqJ4VEXgCoAEC", "text": "1. Arcanine/Growlithe is number 1. Totodile is number 2. After that I am not sure.\n\n2. Emerald. Ruby was my first ever Pokémon game, but Emerald was even better.\n\n3. Somehow, I was actually exposed to both Monster Rancher and Digimon much moreso than Pokémon as a kid. I had a PlayStation and cable TV. Neither had Pokemon, but both had Digimon and Monster Rancher (Card games, TV episodes and video games). I thought both were awesome. Thus, I am actually more a fan of those than Pokémon, but maybe if I was introduced to Pokémon first, it'd be a different story.\n\n4. I agree with you completely here, though I haven't even picked up X or Y, as I'm waiting for Z if it happens (which looks like it will). Then again, the recently announced GO sounds like a fantastic idea!\n\n5. Pokémon would be pretty awesome to live in. I dunno the answer, but I really love the worlds of Persona and Wild ARMs. Persona's based on the real world of course, but hey, maybe that means I'd like to go to Japan..", "time": "4 years ago", "author": "Ben McManus", "channel": "UCw9OGIF695WEplVKInSeEzQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwab7hPAeFcfb3E-HIEoLqA5xyfhZ7Yd4gJLVLa=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghA1mKO9MM4ingCoAEC", "text": "Chikorita, Gengar, and Eevee.\nDiamond\nNever actually played any.\nYes", "time": "4 years ago", "author": "Retrauk", "channel": "UCqBVqaUwgPXJBuMztEea1-Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyyTWzPhIWymwvY5G5nU9JSAM-bagOzYvnc7w2N=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugj0PUHq5SNuIXgCoAEC", "text": "1. Skarmory, Breloom, Bisharp\n2. Pokemon Gold/Silver\n3. Pokemon has always been the main thing for me, but other series do have unique ideas\n4. For the most part, I'm happy with how the series is evolving, except for the difficult, which is just becoming easier and easier, to the point where there really isn't any challenge anymore.\n5. Living in the Pokemon world would be very cool.", "time": "4 years ago", "author": "ElectricFortune", "channel": "UCuQKrr9v3qPEx_L011k5-4g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz63etqHhOotjoR0r1DOk7LpxVhrpPDydXPTEKp=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi95ZUWB3Qy63gCoAEC", "text": "1. Scizor, Houndoom, and Tyranitar\n2. Pokemon Crystal\n3. I never tried any of them but Dragon Quest Monsters looks interesting. If Digimon counts, their anime is far superior and was one of my favorite things in my late childhood.\n4. I haven't played Pokemon since Crystal but I'd like to get on X/Y some day. It looks like it has changed for the better and really brought the franchise on its feet.\n5. If you asked me that question 15 years ago, it definitely would be Pokemon. Now, I prefer to live in Duke Nukem 3D's universe. A world where it's far in the future and still feels like the 90s in my type of environment.", "time": "4 years ago", "author": "NukeA6", "channel": "UCxoYPqKjUw5Rey-DZDYC6bA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxzmqu9SISAKNttP3ZzHUL6zG9_Jj-kA3SArTds=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi95ZUWB3Qy63gCoAEC.84QuauWw5tl70Sli8R41Tt", "text": "@Space Lion\nThe alien invasion only happens twice in that universe and they're more concerned in capturing women for whatever they want them for.\n\nPokemon is an even more dangerous place to live because Raticates can tear houses in minutes, getting burned by a Houndoom hurts forever, Tyranitar can change entire landscapes when it rages, Muk is so poisonous that even his footprints can kill, Duskull and Drfiloon steal children, etc. At least with Duke Nukem around, it's can guaranteed any threat (and political asshats) will get their asses kicked.", "time": "4 years ago", "author": "NukeA6", "channel": "UCxoYPqKjUw5Rey-DZDYC6bA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxzmqu9SISAKNttP3ZzHUL6zG9_Jj-kA3SArTds=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggUHiC9QPCQVngCoAEC", "text": "Did Nintendo ever say why they only had Red and Blue? I think they easily could have gotten away with having 3 versions, each with an exclusive pokémon. \n\nAnyway, I picked Red too! Some of my most cherished memories include staying up way too late under the blankets, awkwardly holding up a terrible light to see the screen while Charmander and I battled deep underground inside a scary cave training and looking for mysterious and rare pokémon! !", "time": "4 years ago", "author": "Dat Indigoku", "channel": "UCOIiwwGtU3XPejIllbyyEBg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwrZye2wTIO55lr12fa3vwGlx5xdpuzzpaAmsm8=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjU0fg82rpZiHgCoAEC", "text": "Good old Route 1.", "time": "4 years ago", "author": "Yoshifreak2000", "channel": "UCATroSqBLmtqPjtrkR8McAw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwgxGOFxL0cfz4rCxUSPfVkfkqbOPK8T_4gqPn4oV8=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggbLCkBOBDDY3gCoAEC", "text": "1. Buizel, Luxray, Charmander\n\n2. Pokemon Mystery Dungeon, I'm pretty obsessed with it. Not sure about main game though.\n\n3. Digimon's a cool show\n\n4. I don't know, the only game I've put a lot of hours in was Diamond. I haven't really played the other Pokemon games enough to really see if I like how it's changing or not.\n\n5. Pretty much, yes.", "time": "4 years ago", "author": "Rocket Ken", "channel": "UC44lZNfVn7E56-4ocSCi6xw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwR2TlmHcmgrTF5i5cKn7DEv_pHiZGaXGMQjSSkpQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiIY_BWRgwxhXgCoAEC", "text": "Welcome back, man.", "time": "4 years ago", "author": "VentusxBBSxSpero", "channel": "UC8jNqZnyRtNHczOsbwVklqQ", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJzbwLV1gLvflbx-EuXlLlxuY705BKxHfbG57olu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgisTJqYAXNJDngCoAEC", "text": "1. Wow, i've never thought about this question too much. There's like 100 out of all the 722 Pokemons I really like.\n\n2. Platinum, HeartGold/SoulSilver and Black/White 1\n\n3. Besides watching Digimon on the morning weekends on TV when I was like 6-8 years old, i've never cared too much. \nPokemon is where it's always been at.\n\n4. (I'll get to that question, but first some some story for perspective's sake) I got my first Pokemon game (Red) in 2000 when I was 5, loved it, got the sequels Gold/Silver/Crystal and Ruby/Sapphire/Emerald the years later, plus the gen 1 remakes. Loved them aswell, 3rd generation was probably the highlight given that it was the time when all my buds at school were in to Pokemon. years later, in 2007 most of them did not care anymore at all. It was just some small kids thing to them, and for a while, I agreed, mainly because the new games Diamond/Pearl had just come out. I did not have anywhere near as fun playing those games as I did with previous games in the series, so then I just thought (at 12 years of age no less!) that I had become too old for it to still be very fun. Almost 3 years later, having played next to nothing Pokemon during that time, I saw that remakes of Gold and Silver were out. After lots of consideration, I decided to try again given how much i loved my Pokemon Gold back in the day. Probably the best gaming decision I've ever made. But then I thought, what make me dislike Diamond/Pearl so much (in comparison that is)? Well, after reading about it i've seen that I was not the only one, and that most Pokemon fans think that the \"complete game\" every generation has in Platinum is far better and fixes most of the flaws of D/P, after reading that, I decided to get Platinum and WOW they were so right, so it was never about me growing too old, it was that the first games in gen 4 was really lackluster. Ok are you still reading? Good, this is where i'll start answering the question; HeartGold/SoulSilver and Platinum are easily the best games among what I like to call the 'conservative Pokemon games' after them, we got Black/White, and they were the first games that truly felt like sequels to the established formula. And it was amazing, it truly was the evolvement of the franchise that was needed. Then we got direct sequels to them, and they were still good, but did not improve at all on what made the first so great. Instead they added lots of random stuff which had nothing to do with what people like about Pokemon, and they did not make the story anywhere near as interesting as in B/W 1 which was a shame. And then a year later we got...X/Y I was really afraid that it would ignore everything that made B/W 1 so great and just go back even further than what B/W 2 did, and my fears unfortuneatly turned out to be correct. Extremely sad, what we got was another game in the 'conservative Pokemon series' with ridiculously lackluster content on top of that.\n\ntl;dr: If you've only played X/Y these last 10 years, Supra, then go back like you say you will and at least play B/W 1. They're FAR bigger improvements from the games released 10+ years ago, than what X/Y is.\n\n5. Oh and I don't think i'd like to live in a Pokemon world considering there are so many things about that world which doesn't correlate to real world logic, if I were to elaborate on that, this part would probably be longer than #4....", "time": "4 years ago", "author": "NetConsole", "channel": "UCYVftGfbpf1UyU5oMn130RA", "votes": "4", "photo": "https://yt3.ggpht.com/a/AATXAJxEqszzER71UO2L_JoMhf7IaVus3ZOKWgtBAg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgisTJqYAXNJDngCoAEC.84QkD-uJjhO7-H3A6PMXWV", "text": "+NetConsole Interesting, I'm definitely intrigued to try Black/White then!", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggjBw9e0Rosr3gCoAEC", "text": "1) Magby, Wingull, Umbreon (There's so many favorites it's hard to choose)\n2) It's either Omega Ruby/Alpha Sapphire or Pokemon XD: Gale of Darkness (honorable to Pokemon Channel)\n3) Not very experience with the clones, but YoKai Watch or whatever it's called seems interesting. For what it's worth evil collecting in SMT games is fun!\n4) i'm happy that the series IS evolving. Slowly, too slowly probably, but I'm happy with what we have. I really pine for a story driven Pokemon game.\n5) I would love to like in the Pokemon world! Alternatively i think living in the Persona world, specifically Inaba would be so fun because I love the characters.", "time": "4 years ago", "author": "BombOmbBuddy", "channel": "UCnSAWSK9ZVJJpTE-ClOQyVg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy7iTY5ulaLq6bgDUKJ1GKyR1EXmIlzoHlAiEVE=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggWwx4tn75MUXgCoAEC", "text": "Hey! Nice to see you around. Had a good rest? Great! Please have a seat, let me tell you the latest, so... \n1. (Stubborn) Charizard, Scyther (yay!) and Ninetails.\n\n2. 2nd gen (Gold mostly)\n\n3. Lost count on how many hours I've spent at Monster Rancher 2! Digimon World 3 was the closest I ever felt a Pkm clone has reached. Wow, look, Jade Cocoon! :)\n\n4. I have the same feeling... a big shake up is needed to bring the series to its former glory. What You think about PokemonGo so far?\n\n5. Hm funny, never gave it a deep thought... Pokemon world looks fantastic and paceful enough to live at. :)\n\nGreat to see you again, once more, Please feel free to take your time whenever you feel like. Cheers!", "time": "4 years ago", "author": "Alessandro Cristiano", "channel": "UCjWbG6wNeEucW60_Tp32dbA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxmlaSpYAA9yZ_npDhDCno5YEwq4ZQo3PgahhKrCgk=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggWwx4tn75MUXgCoAEC.84QirqqFGog7-H4wXbNFkI", "text": "+Alessandro Cristiano From what I understand, Pokemon Go could be very fun, but I'm still trying to wrap my head around its mechanics. I'm  holding back some of my excitement until I see the final product.", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggWwx4tn75MUXgCoAEC.84QirqqFGog7-H7etlfyMY", "text": "I've tried Ingress when it launched. Its an interesting concept for sure. I have similar thoughts as well. Lets see what they'll offer.", "time": "4 years ago", "author": "Alessandro Cristiano", "channel": "UCjWbG6wNeEucW60_Tp32dbA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxmlaSpYAA9yZ_npDhDCno5YEwq4ZQo3PgahhKrCgk=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggXigrHjotNnXgCoAEC", "text": "1. Zoroark, Bisharp, and Victini (too cute) \n2. Black/White, got me back into the series after only playing FireRed and a bit of Sapphire as a kid before losing interest in the series. I remember seeing the animated sprites on a commercial and going, whoa! They finally upgraded the graphics, and I still love those sprites over the 3D models.\n3. Eh, no thoughts really. I always wanted to watch Digimon though.\n4. No, Mega Evolutions were a good idea in concept, but just dumping them on the most popular pokemon causes an even larger power creep. They really should've given more typically weaker 'mons it so they could keep up with the best (cough Flygon cough). I can only see Megas causing stagnation as more and more flood the series :/\n5. The world of Xenoblade (if I'd be safe/have strong traveling partners) comes to mind, Pokemon'd be nice too having a Zoroark disguise as me and cause all kinds of shenanigans would be so fun.", "time": "4 years ago", "author": "21stCenturyBoy", "channel": "UC02_aVfXiOA1yewNdCQcOBQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxSIwMM8CxL6CNjIXlxTsp3kJx6r8oC8Yacl7S3=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggxrAQvKiXxKngCoAEC", "text": "1. Mudkip, Blissey, and Gardevoir\n\n2. HeartGold/SoulSilver\n\n3. I liked the Digimon animes as a kid but that's really it. Never played any of the games besides Rumble Arena 2.\n\n4. No. I played Pokemon often until a couple years ago, and the games are too similar that I've stopped playing all together. They're still extremely easy. The AI is completely braindead, and the trainers' Pokemon are horrible. The competitive play is extremely RNG based. Rather than throw in new gimmicks, they need to change the style of battles, while still keeping the core mechanics. Also, I find a lot of the end content, like Battle Mansion, extremely grind heavy and tedious.\n\n5. If I stopped living in the world when the game was completed, I'd choose Dark Souls. I just want to actually experience that world with my own two eyes once in my life. However, if I have to live there forever, it'd be Pokemon.", "time": "4 years ago", "author": "lacoot", "channel": "UCrXvO8dTQGuQ3S0V74pKipg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwMAXC-jvp9ZGIP7MnuKdQ-Y_WFADJRqWv9DRPIwA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggF49z-UVjCq3gCoAEC", "text": "1. Vaporeon was my first level 100 pokemon and i still have aqua to this day, Arcanine was my first love and was my favorite pokemon for such a long time, Gardevoir is probably my third favorite, there were a lot of pokemon i considered for this spot but gardevoir just hits a lot more nostalgia points for me\n2. my favorite pokemon main series game is pokemon white 2. the story was downgrade from white 1, but the amount of content they put in the game was ridiculous. i spent hours on the game and was still playing when x and y came out. my favorite spinoff would have to be pokemon colosseum. i love the different tone they took with the game and how they made the entire game double battles. i also liked the limited set of pokemon because it forced you to choose pokemon you probably would have never chosen.\n3. I don't mind pokemon clones, but i'll probably never really play them, the closest i got was wanting to play digimon. You just cant beat pokemon.\n4. I'm not really sure about my answer to this question. I feel like each iteration takes several steps forward, but also a few backwards. for example, pokemon black and white had phenomenal story, but the pokemon designs were probably my least favorite (i actually like the vanilluxe line) and i didn't really play the game that much after i beat the main storyline. there just wasnt that much to do. then with white 2, they added all sorts of crazy new content that expanded the game in incredible ways! but the story was meh and it was still the same set of pokemon. then with x and y, they added all sorts of stuff like trainer customization and megas fairy and 3d and skating and different battles and the possibility of two type moves and made it way easier to get into competitive battling, and while they didnt have a lot of pokemon, it was probably the best batch that we've gotten since hoenn, in my opinion. but the game had incredibly little afterstory and i havent played it since. then ORAS didn't really do anything to fantastically new other than travelling on latios, but it was just a remake and they left out the best parts of emerald while heartgold kept the extra stuff from crystal. we still have yet to see our pokemon outside of their pokeballs since heartgold. i really think that they could create a fantastic game if they kept every good feature they've introduced, but they just keep taking it all away.\n5. The world I want to live in the most is the avatar world with all the bending, but pokemon is an incredibly close second.", "time": "4 years ago", "author": "Mebrother9", "channel": "UCI2jNczIibEuHzLmdc5Xjdg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwnPJsgYGTKiTvwYTMJ23MHzqZDUCQ893Qnwr3E=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjLx6HIIe02kXgCoAEC", "text": "Amazing choices for OST, but my favorite part of this video - and why it's one of my favorite videos from you - is your commentary in the video.  It was amazing reading so much enthusiasm for a game that you loved as a child and growing up, and it made me remember my experience with Pokemon growing up, too.  I'm not sure if this is going to be a regular new thing, but I hope you consider doing it for some particularly memorable future uploads, too!\n\nAs for your questions...  \n1.) Bulbasaur was my first starter, so he always holds a special place.  Otherwise, Metagross and Serperior are high up there.\n2.) Ungh.  Either Heart Gold or Black 2.  Can't choose...  HG for its atmosphere and the culture I can feel in the world.  It also has my favorite collection of Pokemon (Gen 1+2).  And Black 2 for its content.  So many places to explore, so many things to do.  Also, I like the story.  Recently, I've grown rather fond of Omega Ruby, but some factors hold it back for me.  Amazing atmosphere, though.  The world feels more alive and rich than almost any other Pokemon game.\n3.) I ... am of the party that doesn't call Digimon a Pokemon clone.  But if we're talking monster game genre in general, Monster Rancher and Digimon were my favorites.  I think these two have different enough focuses from Pokemon that make them unique and fun to play.  Ni no Kuni (if you can count it a monster game, hah) is a good one, too, and we'll all see how Youkai Watch is shortly in the future.\n4.) I think there are many changes that can be done to make the game more dynamic, but I respect the slow pace they're making the game.  Their target audience and their high stakes in the game prevent them from shaking up the main series too much.  That's why there are the spin offs that can be more creative and more daring.  I also have split opinions on the way the emphasis is more on story now; sometimes it works (ORAS) and sometimes it doesn't (XY) for me.  I remember in RBY it was a simpler time.\n5.) Pokemon, yes.  Digimon, too.  These are two of my favorite childhood series, and I remember pretending that I had Pokemon physically with me when I was outside.  Imaginary monster friends, haha.\n\nBy the way, if you're interested in trying spin-offs, I'd like to suggest PokePark 2 for the Wii.  It's an often looked-over spin-off, but I'd always thought the Tales series battle scheme would work well with Pokemon (four special moves, it's practically asking to be adapted), and PokePark 2 pulled it off.  I didn't see it on the list, so I wasn't sure if you'd played it, but I can definitely recommend it :)", "time": "4 years ago", "author": "terracannon876", "channel": "UC9w5Q0ucUzw-UZmTGS0KZfA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJz58JPSonPCMdUYCBLMZJnPjZCWvH6nYP64LD-E=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjLx6HIIe02kXgCoAEC.84Qff98ZzSA7-H8fvl98lM", "text": "+terracannon876 Actually, this kind of video format with detailed commentary is something I've been using for x00 entries in this list (1700, 1600, etc.), so feel free to check those out as well. I haven't played PokePark 2, but thanks for the suggestion!", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjLx6HIIe02kXgCoAEC.84Qff98ZzSA7-HF3o0w46S", "text": "+SupraDarky Ooh, thanks for the head's up :D  I've been skipping around in the past, and I don't think I've landed on a x00 entry yet.", "time": "4 years ago", "author": "terracannon876", "channel": "UC9w5Q0ucUzw-UZmTGS0KZfA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz58JPSonPCMdUYCBLMZJnPjZCWvH6nYP64LD-E=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjLx6HIIe02kXgCoAEC.84Qff98ZzSA7-IrEzN9nWe", "text": "+terracannon876 You've been missing out then ! All x00 entries are series (really cool series) with commentary... go check 'em out and be amazed ! :D", "time": "4 years ago", "author": "Aganhim", "channel": "UCgypARaIGvo3wLjOFeyKtMg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzFd8srXuAwQA_wWBqmY5PLFNP5JDJ3O1m7zU5J=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiQpGa8cf78bHgCoAEC", "text": "1) Charizard, Kingdra, Milotic\n2) Ruby/Sapphire/Emerald. Always thought the male character had white hair which was cool until i realised it was a hat in the remakes. Lots of interesting designs for the pokemon too\n3) None of them ever attracted me. Pokemon reigns supreme\n4) I hate the mega evolutions and how they force it more and more instead of finding new pokemon and giving real evolutions to forgotten ones\n5) Mass Effect. Because Asaris", "time": "4 years ago", "author": "Plot Twist", "channel": "UC9yadLzG4yDcYUnDKsiye3g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx7WdpqX2lzQX1fktcmX5OjgoQAhdxY-fAetnY0Pw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghLbyZ6w0MUy3gCoAEC", "text": "1.Alakazam, Gengar and Charizard (my shiny Black charizard )\n\n2.RED (my first cartridge, my most memorable experience), Silver / Soul Silver and Platinum (because there I found finally a shiny charmander who became my black charizard :D ) \n\n3. Hoping to see a good game about Digimon Tri (that follow up to Adventure is my most anticipated anime this year)\n\n4. Haven't played X yet, I guess I 'm feeling kinda fatigued about pokemon since Black and White, so i'll wait up.\n\n5. My favorite  world that I also love  to live there is SKIES OF ARCADIA WORLD, everything about it I love it with all my heart, deep good memories!", "time": "4 years ago", "author": "Kevin Mejia", "channel": "UCCvZ15jB-Pfip2_sjzvttnA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzoDIO1yLWvA--sLcks_Qj7mJV8pzuHdlklAIfIrg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggCS6aPwPYDw3gCoAEC", "text": "Ahh pokemon, i had so many great memories playing these games especially from the first generation.  I remember playing Blue/Yellow with my lime green Gameboy Color and using the wormlight attachment.  Now to answer the questions,\n1. My three favorite pokemon are Squirtle, Mewtwo, and the Rotom forms.\n2. My favorite pokemon game is definitely RBY.  So many incredible memories playing that generation.\n3. The only pokemon clone that i watched was Digimon.  Along with the pokemon anime, digimon was one anime that i loved watching growing up and i still watch it today.\n4. I like where the series is going especially with the addition of Mega Evolutions in X and Y.\n5. As for the video game world  i would live in, it would be the pokemon world especially for X and Y because i have always wanted to visit Paris.", "time": "4 years ago", "author": "Eric C.", "channel": "UCW-NCSWtwr76dBreDd6jAYw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwZUTZb5cKg6joDbmEtTsOCxELWMYvBf92-CCID=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi4XlaP7-8BungCoAEC", "text": "1 - Charmander,  Swellow and Gardevoir.\n2 - Yellow\n3 - Never played one, but i see the creeppastas about pkmn.\n4 - Not much, i hyped on X/Y and bought on first day. I played with my friend at the same time and enjoy a lot the beginning but after the 4º gym i started to fell the game are still the same. \n5 - \"Pokemon all the way! It may not be the most perfect world, but it's the world for me.\" (Hs00129)  <- THIS.", "time": "4 years ago", "author": "Jefferson Jales", "channel": "UC5TDczRYA590s3NivGaj4DQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxq8-J7xUFm8dCfA5ibvyky5LkbZ3URjrsyx0nO=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghKnslxACB90ngCoAEC", "text": "1) Charmander! Eevee and Vivillon are probably my other two favorites at this point, but it's hard to choose.\n2) Gold/Silver/Crystal/HeartGold/SoulSilver\n3) I liked Digimon, but I never thought of it as a Pokemon clone.\n4) I enjoyed X and Alpha Sapphire, but I would love a game where you could go to all regions.\n5) I've definitely thought about living in a Pokemon world!", "time": "4 years ago", "author": "Piano Elf", "channel": "UC_l6_vLzJ548KuLCtYbGVFw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzrZv5gPqEWPFB8k4CnMWdXzUlNx_8G5sMofhSmLA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiXT07WhOvJtXgCoAEC", "text": "Man, reading about your Pokémon experience made me feel nostalgic for mine. It was very similar to yours - a fascination with Red/Blue/Yellow which turned into an addiction with Gold/Silver as well as religiously watching the anime and collecting Pokémon card. I wish I could bottle up the wonder I felt when I found out you could return to Kanto in Gold/Silver. Unlike yourself SD, I didn't experience franchise fatigue until Diamond and Pearl. I loved Ruby and Sapphire and poured just as many hours into those as I did with the first two generations. Diamond and Pearl came along... and I was just worn out on the series. I know they're solid games, but I was fatigued with the series. Like you, I returned with Pokémon X and had an utter blast, and I enjoyed reliving Sapphire and Ruby with their 3DS remakes. As for your questions:\n\n1 - My three favourites are Umbreon, Oddish and Bellossom. I fell in love with Umbreon's design right away. I had a stuffed toy of Oddish which I got from a fast food restaurant so she became one of my favourites too. As for Bellossom, I always hated evolving Oddish into Vileplume as I didn't like its design, but I really liked Bellossom's.\n\n2 - Gold/Silver, no doubt.\n\n3 - I've never played any, so I can't chime in! Digimon World is the closest game I've played to Pokémon, but I think it's more of a traditional RPG than a monster catching RPG.\n\n4 - Not really. X was great, but there seems to be a push towards either competitive play with IVs/EVs which doesn't interest me whatsoever and towards a more casual audience with the F2P 3DS spin-offs and with Pokémon Go. I just want a healthy middle ground, which I'm sure I'll still get in the main-line Pokémon games - I likely won't get as fascinated with Pokémon as I did in my younger days though due to the end-game being more competitive focused.\n\n5 - Pokémon would be up there, but I'll always thought living in Mass Effect's universe would be amazing.\n\nApologies for the wall of text! Looking forward to hearing your upcoming VGM picks - it helps me build my VGM playlist and remember some old faves.", "time": "4 years ago", "author": "JayMoyles", "channel": "UCiw0WcjQhSfdVxjGdrrX1Aw", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJyijh0cSVvbSC3IgkHZ4Q4DCd2fvOYjSN_JpUU0=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugh7fWhVkgmhZHgCoAEC", "text": "Piloswine (my first card), Aggron (metal skull dinosaur. What's not to like?), Bulbasaur (I really don't know why).  \nI was pretty into Crystal for awhile, but was always more into the cards. and anime.\nThere was one pokemon clone which had randomly generated monsters, and they could be fused, or generated from other cds, wasn't there? I remember being blown away when I first heard about that, but never actually played the game.\nI'm basically done with pokemon by this point, except for the nostalgia, so I really have no opinion on the matter.", "time": "4 years ago", "author": "PsychadelicoDuck", "channel": "UC2MpZha0M4wsQqERDEmU58Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwqdJg5W2bA6m9ahKO8sVoGAeg7X7-3PaUchA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggXOCNYoc785HgCoAEC", "text": "2:12 - Oh hey, it's my favorite Pokemon! :D", "time": "4 years ago", "author": "Yuki Mizuno", "channel": "UCuYX_2wINKLBwFkpwujjC3A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzXZJCrZZGh64C9_oK2jDuEXXIIXrpraQMifU3dZQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghvbbzKZ401bXgCoAEC", "text": "1. Tough choice, but probably Treeko,(my first starter Pokemon and who I was in the first Pokemon Mystery Dungeon) Skitty, (cutest little thing in existence) and Gardevoir(more Mystery Dungeon Memories)\n\n2. Tie between Pokemon Sapphire, Pokemon Black, Pokemon Black 2, and Mystery Dungeon:Red Rescue Team\n\n3. Never played one, but Telefang looks interesting\n\n4. Honestly, I didn't care much for Generation 6. I really don't know why I don't like it; maybe it's the full 3D aspect; maybe it's the increasing complexity, I don't know. Now, Pokemon Go, IMO, is a step in the right direction. Don't get me wrong; I want Pokemon to stay on Nintendo consoles. It just seems right, in a way that it really is the closest thing to Mr. Tajiri's original vision of Pokemon, and definitely is something I only could have dreamed of as a child.\n\n5. Pokemon all the way! It may not be the most perfect world, but it's the world for me. \n\nThank you SupraDarky, for bringing back memories and creating new ones. :3", "time": "4 years ago", "author": "Aegis29", "channel": "UCKymmHM7V0jHeyZAK4qFVZg", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJxDr8y4XLhMMYsYzgootu2Neq8BBe47bdBNoQICKg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghJ0d7cZV2p6XgCoAEC", "text": "My three favorite Pokemon are Charizard, Gengar and Zapdos, but I don't have much else to say on the series considering I haven't played many of the other games.  I'm not one for grinding, and collecting in games has never been too much of an interest to me, so my Pokemon experience has always been to get my 6 favorite Pokemon and use them.  Admittedly, that even gets tedious after 2 playthroughs, which Is why I don't play Pokemon that much.  Still, the series is a surprisingly deep and fun RPG, and the franchise undoubtedly played a large part in my childhood.", "time": "4 years ago", "author": "TedKennedyX", "channel": "UCS27-wPDTJA8mSWiSW_aXaA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJwQvB7W4jjaWuvCSx_BuA4nARe4qAxuuUJHwwZP=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi2YQABc86Ou3gCoAEC", "text": "Yesss!! SD is back!", "time": "4 years ago", "author": "DonCanoli", "channel": "UCPfVBLEADTrl1QJbc9Z8feA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJz4CdOMNkaV2R2QdyxySmh0rNY0U1AKF87x3BMk=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC", "text": "And I'm back! This was definitely a longer break than I thought I'd take, but I told myself I would simply get back to it once I was fully refreshed and ready. With the Fall season coming up, let's be ready to put on our comfiest warm clothes, sip on hot beverages, play anticipated or retro games, and discuss about various games throughout the continuation of this list and our great community!", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "67", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-H0k8Q6LPb", "text": "Pokémon finally gets its deserved x00 entry, having such a huge effect on my childhood. After all, Pokémon Red is in my top 15 games of all time.", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "13", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-H14m-5spo", "text": "Yay! You're back! Awesome choice for la numbero 1800!", "time": "4 years ago", "author": "yuWIN", "channel": "UCsYq81vATgEK8ge4ablFmOA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyHXnLgasNlvvsvD8Xrp7szBK6PyGQQdKPM-dzv1g=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-HEdVyKR7m", "text": "+SupraDarky Why did you use the terrible audio version that circulates the internet? The echo effect is really annoying, and doesn't exist in the original game.", "time": "4 years ago", "author": "MegaZeroX7", "channel": "UCO31qqgb2q_qykXn5si1e2g", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJwBKX8XiWKZo2lDNY3Z-W0zN6WJtocBg48GlQe0=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-Heri-Tc4H", "text": "+SupraDarky Welcome Back! Lots of nostalgia this song has for me. Long road trips...so many batteries...huddling around a lamp for light.", "time": "4 years ago", "author": "VictorVonFox", "channel": "UCETY7xFN05onxa6GGXKg1tg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwQcC4n5niThpK3pYOtwCgloILqwon4Nkb9BBwv=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-I9aYIFvxy", "text": "+SupraDarky 1. Charizard, Mewtwo and Arceus\n\n2. The Mystery Dungeon games.\n\n3. I like them.\n\n4. Yes, I am.\n\n5. Definitely the Pokemon Mystery Dungeon world. I dunno why, I kinda prefer actually being one and actually fighting, talking to other Pokemons instead of sitting in the backside barking out orders.", "time": "4 years ago", "author": "ZPokemonfanA", "channel": "UC_X382AuYuGZ2JuV4XKRr7A", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwYigGykn4Ig92aLIWNRGM8dOrn3g0hrSf2Ow=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-IAuoM7DO8", "text": "Welcome back SD! Good to see you again. ^_^ Thank you for all the beautiful content you get us!", "time": "4 years ago", "author": "beatlechick14", "channel": "UC-wFW0r4ZiBjgcH8h2B3abQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzi2zScFhRlKuFit73WSz4TB_JWjzUIDUAEPEUF=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-J5xxwPoys", "text": "+SupraDarky Good timing. I was just about to post on your wall saying that you're just being lazy and that it shouldn't take more than a couple of hours to make a slideshow with video game music playing. Glad it didn't come to that. :p", "time": "4 years ago", "author": "David E.", "channel": "UCJNsvh33KhHeROeelPRtbEA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzcqXIZ8lDIxJJB9wEi63195Z14bknK7aLhyqJyog=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO47-KmW7M67TW", "text": "+SupraDarky Welcome back!", "time": "4 years ago", "author": "Jay DiNItto", "channel": "UCaCZjnx2GLsNVlIqHZJwMAw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy0Lm3_U2KrUpZt5Ry56OYXRhKxL_2gVOfs9HPCaw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW99tnQ9P9XXgCoAEC.84QVWRuaLO489oISIgX1ba", "text": "+SupraDarky Hmm is this the first time you've used this many tracks in one video?", "time": "4 years ago", "author": "ragnaroktomorrow", "channel": "UCje5lthydq7ycRifvCzNxog", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxXgBiAm42Nel-j8mhe0mnELWIJIr7xriysO6tNRA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjAEMOop3vcNXgCoAEC", "text": "Mmm dat nostalgia.", "time": "4 years ago", "author": "Austin L", "channel": "UCdDeXfeeswzyqYrFXO2UNLw", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwlD7Wo4SyJhOja9LxkN7-_udVc3zEln1DBAWyQ_g=s48-c-k-c0xffffffff-no-rj-mo"}
