{"cid": "Ugh7wOHNh037PHgCoAEC", "text": "I've never been a fan of MMORPGs, but I've ever play one of these games, I'll definitely go with something like Guild Wars. No monthly fees are the actual way to make a good videogame which is also friendly with the player. \nBesides that, I gotta play something with Soule's music, is just mesmerizing. Any recommendations? Not much a fan of TES saga. \n\n1:30-2:10 section captives me, yeah :)", "time": "4 years ago", "author": "Quinoa: Música", "channel": "UC1UlGDBin3ESoGwvQLPz7dg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJw50k9tll7plIbbcPOeOfhKHbVGo9HZdDsdc1h53A=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgghFHtrv3EtZ3gCoAEC", "text": "Ohohohoho, I still love this game, still play it! :D", "time": "4 years ago", "author": "Alex Arft", "channel": "UCLc3XnzR8ixdqmLtFUOhQ4A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyQqdguL51dbWi7hqRKpgmuyavhFpGrpSqIjA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgixTCOoCUNlOngCoAEC", "text": "I only played this game very briefly when it became free to play, so I'm surprised that I actually recognize this music.", "time": "4 years ago", "author": "Chicken Guru", "channel": "UCR1cTB_F06ESWJm2KH4rEsQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJxE0h2WLaCNSZYjgd6kBp1b_Ue22DYmc3Mw2Ou7cA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjUmj9mhI7I5ngCoAEC", "text": "I really need reasons to get back to this game I don't know why I got bored with it after spending a few months enjoying it a lot. Please I will appreciate it cause I have the game and haven't played it in a while.", "time": "4 years ago", "author": "LightyGab", "channel": "UCLWX21vvuAAzFEun-UQmIvw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx1exq2QixK0iI5P70-KmTWQDfcD92JJHuI70wv=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi2XorWprlrG3gCoAEC", "text": "Ooh, the Shiverpeaks musics.  My favorite of the starter zone themes!\n\nPity the snow starts to wear after a long time vying for map completion.  I should go back to playing this at some point, I'm only about halfway through the expansion.\n\nBy the way, if you're looking for other recommendations that haven't yet been featured: \n- Fear Not This Night (Instrumental) - from the main story climax (although they have a vocal version as well after the fall of Zhaitan.)\n- Dry Top (Living Story season 2, which occurred before Heart of Thorns)\n- Labyrinthine Cliffs (the Bazaar of the Winds, which is no more due to the events of the Living Story part 2)", "time": "4 years ago", "author": "Honatuto", "channel": "UCpI5fzJCqVAwIkHRW5r_jwA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzqpg2IHfktT6K--1MCR08l7uz5PDpLWEOhYacy=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg_dKe8IGdZdXgCoAEC", "text": "Still playing this game to this day. You should check out some of the music from their latest expansion \"Heart of Thorns\".\n\nArenanet's soundcloud is a great place to hear some of their latest music from in game.", "time": "4 years ago", "author": "TheReaLFrankage", "channel": "UCgBdhGy4-gGSLsJE32bSFdg", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJxSHmoN7yAKZYrCY-rf24vMxxvYdQl0GfgNnATX=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghkoynbZYHQ8XgCoAEC", "text": "I loved the time I spent on this game. It left me satisfied and I didn't feel bad simply stopping when I had enough. No monthly fees made me feel like I could leave the game anytime and come back to it when I felt like it, though that never ended up happening. The music was amazing, Jeremy Soule truly is a genius composer. The whole 1:30-2:10 section is wonderful, I had to stop playing and listen the first time I heard it, like with many other tracks.", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "17", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghkoynbZYHQ8XgCoAEC.8GHws_GnTwZ8GI-qWADYzA", "text": "what do you think of the \"Sea of Sorrows\" its another piece of the ost\nthe artwork of this game is amazing as well. The loading screens are always very inspiring drawings", "time": "4 years ago", "author": "holmanspain", "channel": "UCgtUoJGC-FUp7buPdrDPDcg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyQBIm6yn_TuWkYp-kbSPNP2qzvo4sPeOz0pQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghkoynbZYHQ8XgCoAEC.8GHws_GnTwZ8GI5mYj9VDd", "text": "Absolutely beautiful game, with an equally absolutely beautiful OST! I also really loved when I could just stop playing when I had enough. I just wait for more updates, then get right back into the game! The soundtrack in this game really fit, and the final song that plays after the main game \"Fear Not This Night\" sniffles so surreal!", "time": "4 years ago", "author": "GamingNobility", "channel": "UCOVBsLKQkev_c48LIIFn9KA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwVqYebOjCQAWGB71qTS75C3sfd6Hq0A9KnK1Yu=s48-c-k-c0xffffffff-no-rj-mo"}
