{"cid": "UgwEZ3JD76Nm05YRjWV4AaABAg", "text": "Hey dudes, what silent hill game would you suggest someone start with who never played any?   Just go in order or start with Silent hill 2 ? Thanks!", "time": "2 years ago", "author": "xSayPleasex", "channel": "UCtU-V-Sncad2nwEwxs51uuQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxmGOfkaE1c4j-qaIXAz-EsQYvMhI2P1q5DBDb_=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghfFj2e0_xcY3gCoAEC", "text": "1. I love horror games when they're done cleverly and not just cheap jump-scare fests.\n2. My favorite series is probably Silent Hill, though there have been plenty of stand-alone games I've enjoyed.\n3. Silent Hill 2 all the way. Of course, I still love the other ones I've seen so far, AKA the first three.\n4. Twin Victim. At least Pyramid Head's slower than I am, and usually only goes after people who have committed sins, usually of a sexual nature. Being an asexual, I shouldn't have to worry too much about that.", "time": "3 years ago", "author": "The13th Rose", "channel": "UCjxA4M54pfE_QFfLpCbZlyQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzxVXeI5TrolNCmguCtTCm6aYNeatS8JiIqT2sE=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugh5k1ie2vChOXgCoAEC", "text": "1 Yes, as long as it's same like you said Smart Horror syle, Frightening environment design, Good ambient sound design, Great puzzles.\n\n2.Unfortunately I was a child when the first silent hill hit on PS1, it's so frightening for a kid\nso I couldn't vote for silent hill, but as today I would like to vote Amnesia the dark decent.\n\n3. If I could choose P.T, so be it.\n\n4 I'm going to take selfie with Pyramid head.", "time": "4 years ago", "author": "DP DP", "channel": "UC6811Y-ttGBQZIi78mNJWWg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzhIGY2YLrHn1d60fxrJzW84gwE6nWU0E5rrldTYg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugj9TWdHBvDlJHgCoAEC", "text": "Eternal Darkness, best horror game I have played.  That and Resident Evil 4 for the wii.", "time": "4 years ago", "author": "William Frazier", "channel": "UC2gl-OpA5jzJ2sbZ4R4r-bw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxeb0itl1Vlwn0CXpmOa8UmXlvTgCLDfrV2_g=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggPyC1-U9au1HgCoAEC", "text": "Oh wow, I'm all caught up! I'm surprised how quickly that went lmao. Can anyone tell me how often SD uploads songs? :s", "time": "4 years ago", "author": "greenyxi", "channel": "UC6CzSBa0mlRzOiSBmZRGr0Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxCFe85DzQGnhP30n1eyZM6zyWE0VBKVmYkTqT-ug=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghizxqiC9m2hHgCoAEC", "text": "Silent Hill 2! By far the best horror game experience I've ever had..other than Silent Hills PT", "time": "4 years ago", "author": "Leonhart", "channel": "UCBHD6Yg8R1yS9akfGm4mecQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzdopl7CGjbff28a0ICM_a5_tf56CWhnGStIgcqYA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghizxqiC9m2hHgCoAEC.8Ci0pv2UZNw8QxTrRAiuRD", "text": "Respect", "time": "3 years ago", "author": "ncshuriken", "channel": "UCH4-01ztMRtpw_CzH4dWWpA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz91pWMjYy5tYgwKiS5B5oj4dOVx5OvHNwvDAnb=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggvqGxHCQCSbngCoAEC", "text": "We are in the 20th century now. Yay! Only a matter of time until you get to 2016.", "time": "4 years ago", "author": "Joshua Fagan", "channel": "UC1Wyw1N5Gv4IPSI7vztW1Ow", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJy9w3QlCFx6bD15gMCkFYUPN6oN65DH0zAgxhBZQpU=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugh63geS6v_OK3gCoAEC", "text": "1. I do enjoy horror games if they have a good atmosphere and don't rely too much on monster slaying.\n\n2. The Silent Hill Series is my fovourite as well, Project Zero (Fatal Frame) and Resident Evil also have strong entries in their series.\n\n3. A lot of the time I can not decide on a favourite between Silent Hill 2 and 3. James is an interesting character but I could not relate to him as well as to Heather.\n\n4. The Twin Victim is definitely the thing I wouln't want to encounter alone in an alleyway. It is so digusting to me in every way, I feel uneasy when I think about it.", "time": "4 years ago", "author": "Wynard", "channel": "UCCC2G-xBeUb0_qeP6Ma6cuA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx27jA6IpGNnYq_EwzpugLfwu9Br9epwXNPtqwg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghZ89rX5kEDl3gCoAEC", "text": "Silent Hill tiene un estilo en su banda sonora único que causa esa atmósfera de terror que en mi opinión particular es bastante buena. Saludos y excelente vídeo. ;)", "time": "4 years ago", "author": "jorgais reyes", "channel": "UCCDD6069p8ZNgTFY5jLNFPg", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJyjVYHe3OQTF9SV6kldmB6LRa8w5PFu7Su8F_KKpw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi8n5WvOZytZ3gCoAEC", "text": "1. Yeah, I like anything horror and not just videogames.\n2. I don't have a favorite\n3. Silent Hill 2 although Silent Hill 3 is tempting since it's based on my favorite horror movie, Jacob's Ladder.\n4. Twin Victim", "time": "4 years ago", "author": "NukeA6", "channel": "UCxoYPqKjUw5Rey-DZDYC6bA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxzmqu9SISAKNttP3ZzHUL6zG9_Jj-kA3SArTds=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugh6xp_3yubB3HgCoAEC", "text": "1. Nope. I'm a big wimp so I can barely even watch some. However, I'm often intrigued by the atmosphere and design of horror games, and my brother is a big fan of them. So I still spent part of my childhood watching him play these games.\n\n2. This is purely from a viewing standpoint, but from the ones I know something about, Silent Hill or Shivers. Silent Hill is easily one of the best horror games I've seen, and to this date it still seems to stand out among the hundreds and hundreds of horror games. The atmosphere is fantastic, the designs frightening, the music great. It really feels like this town could exist somewhere out there. It's also one of the few horror games where the main feeling I get out of it (aside from fear) is sadness and grief.\nWhenever I need to look up inspiration for psychological horror (art wise) this is the go-to franchise.\n\nShivers is purely for nostalgic reasons. This is THE horror game I watched my family play as a child. Most experienced horror players would probably consider it silly (especially the ixupi) but god damn it it still scares me. It's also interesting to compare it to modern games, considering how it's scenery, music and gameplay is very different form many modern games. \n\nI wish more horror games dared to go outside the norms and even be a little cheesy. Instead of competing for being the scariest, they should try different genres and scenarios and let the horror aspects come naturally.", "time": "4 years ago", "author": "CinnamonThief", "channel": "UCT2tDFM3MiqyWp7I20aTHNA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw9E10MmSTqZUCb3rqwOIyFaoEPcv87n0AhA2ST=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggJ-8SpYHjAG3gCoAEC", "text": "Not really a fan of horror games. I remember seeing the ads for Silent Hill in the comics when I was a kid and those freaked me out enough as it was.", "time": "4 years ago", "author": "PsychadelicoDuck", "channel": "UC2MpZha0M4wsQqERDEmU58Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwqdJg5W2bA6m9ahKO8sVoGAeg7X7-3PaUchA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugivn2yzD9RBq3gCoAEC", "text": "1. Sometimes\n2. Resident Evil\n3. 2, since it's the only one I played.\n4. Twin Victim\n\nI think you should have asked what your favorite horror game singular is.", "time": "4 years ago", "author": "jdng86", "channel": "UCg5dGxTZ9UrZ3W1gUIW_oYw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwuXsidrj7rdsWYa8DfoQHHCz7aYbQW6nliAvPuDw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggvXgOsqGdhpXgCoAEC", "text": "1. I used to play horror games all the time, but now the horror game industry has taken a turn for the worst. (I'm also more of a fan of the unknown and scary environments). so I've stop playing them in general.\n2. Silent hill or early Resident evil (I grew up playing both and can't decide)\n3. Silent Hill 2 by far\n4. Pyramid head: Not only is he intimidating and scary, he also has a aura of mystery, grief, and dread to him that makes him more interesting than the Twin Victim.", "time": "4 years ago", "author": "MrTw1st3r", "channel": "UC-jt7vZSA91utPl1BXg5ERw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJziqHtVyN1JDL_JirdFXNO79UnDSgGMp9DS_GaM=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjPV_JefK1nuHgCoAEC", "text": "1. Yes\n2. hm... franchise... Resident Evil has three awesome, one very good, two good and a few forgettable games. Even though i think Silent Hill is way scarier, i'd still go for Resident Evil.\n3. Nr.1>3>2. Havent played more silent hill games than those. But even if i think 2 is the weakest of them. It doesn't mean that i think it is anything but good.\n4. Probably all of them. That guy, even so he may be your \"everyday person\" has balls of steel.", "time": "4 years ago", "author": "AdlerSchwadron", "channel": "UCmE18d63jWkErRySqBA0wCw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxu8QbFwfi2pV4TBORyamFrTx8j7dQHdZMwZwtb=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjHoEsfR_9sJngCoAEC", "text": "There never was a \"Team Silent\". Key members of the team changed between every game from the first to the fourth, too. Only Akira Yamaoka and Masahiro Ito (who didn't work on 4) link these games together in any meaningful way.\nThe directors, producers, all changed between each game. The director for 2 was a motion cutscene/ backgrounds designer in 1, and the director for 3 was credited with \"character motion\" in 2, too. The guy who wrote the plot for 2 and 3 was just an enemy/ event programmer on 1 too. The director and scenario writer for 4 was also the drama director in 2.\n\"Team Silent\" doesn't exist, in the way that each game was made with different visions from different people each time. There is overlap between each games, but most of the key roles were handled by different people.", "time": "4 years ago", "author": "Shad G", "channel": "UCWu6Zgr0L_ROZ1x9EElnm5A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwU786Mp5uQeBeQmITnrAmJliKn9-f4rPRwtfLTeA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghtpPRJET85Y3gCoAEC", "text": "1) Yup\n2) Silent Hill\n3) Silent Hill 2\n4) Pyramid Head - The Twin Victims generally ignore you if you don't go close or attack them.", "time": "4 years ago", "author": "Clockwork Knight", "channel": "UCATNyBxvMrH5ccwl0ITp0Fw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzbk-wCn4bialPWh1zsqnUQPmIPc-Zk_8xBxh-5=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghDP4_6BGdGCHgCoAEC", "text": "See this is the reason why I have to play Silent Hill at some point. (also wew, I used to always wonder where this song was from because of some random Herobrine video that had it somewhere).", "time": "4 years ago", "author": "K.T.B.", "channel": "UCw-4GjPVthfnQ7j_rGSsLxg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwIpeKZvGuiFlOmFKnWrfEBYzJ6R5VgkNZ0xn-o=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjRTchgw8wLsXgCoAEC", "text": "1: I love Horror games...in theory. I'm however way too easily frightened to play them by myself. XD Before, I used to play them with friends (who found great entertainment in watching me get scared), but that's become difficult lately, so now I don't play any horror games.\n2: Silent Hill, easily. I love the setting and the themes, and it makes me chilled to the bone. Special mention to the Siren-series, though, which deserves more love.\n3: Silent Hill 2. First one I played, and I fell in love with it immediately. \n4: Pyramid Head. Just seeing him would have been terrifying. He wouldn't even need to do anything, I'd just die of fright.", "time": "4 years ago", "author": "LordMyoo", "channel": "UC-sJdDVqIdMsgVycZ3UYZOQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxURZYHVJ-gMaSXjDPD3sGRKeyNB5zA--nVuQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiX_-_PmU0u83gCoAEC", "text": "1. I don't enjoy them very much but if the mystery is compelling, darn it, I'll force my brother to take the plunge\n2. My favorite so far is the Silent Hill series. Although I would love to see what others I haven't had a chance to see\n3. My favorite would have to be Silent Hill 2. Although I have a special place for Silent Hills (P.T.). Just the thought of what could have been with that phenomenal small taste Kojima gave us makes me very sad.\n4. I don't know ...", "time": "4 years ago", "author": "7fallingstars", "channel": "UCBIOiTJz3OW6cMFiOVTZ0kA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxbC7qZCndw-1ZsyD8En9_tZqansL1ii3Q0jQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiW1myOJsLRq3gCoAEC", "text": "Honestly superdarky silent hill 4 is probably my favorite of the series,strangely even though most seem disappointed with it.in this game disturbed me more then the previous ones but i can't be sure why...I think it maybe due to the fact that you are aware of the real world like the people in the streets and the cars passing by but yet disconnected from it,it even now leaves a disturbing feeling inside of me like lonely despair.", "time": "4 years ago", "author": "Seti Amon", "channel": "UCmIPsE_smqqJ1CsC9JVBRmA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyMuoKvBtlpmLMesiqAXyI-pDxB6jvPVHLBq5vh=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgixmTshrPFyQHgCoAEC", "text": "1. Yes, but I've only really watched them before. And I know playing them is an absolutely different experience. (Ok, well I did play a small bit of FNAF for iOS, but that doesn't really count.) I do have a large interest in playing them, though.\n2. Like I said, I haven't really played any true horror games before, so I can't say.\n3. N/A\n4.Twin Victim. And this is my first time ever seeing it. It's creepy.", "time": "4 years ago", "author": "Aegis29", "channel": "UCKymmHM7V0jHeyZAK4qFVZg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxDr8y4XLhMMYsYzgootu2Neq8BBe47bdBNoQICKg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjJybz7C9lTd3gCoAEC", "text": "1. Yes, horror games are always fun\n2. My favorite would definitely be resident evil. Yeah the series has gone downhill gameplay wise, I still enjoy the overall story\n3. My favorite silent hill is the second one. It is the first horror game I remember seeing and I was always too scared to play it when I was younger", "time": "4 years ago", "author": "XmasterlinkxX", "channel": "UC3FzGwQ_kpHeVkvk1lWu-UA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz26ShQ5iVxAeyHI_VAYoQerkLbr9_g2mzsl8WZ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Uggz_fthROINCngCoAEC", "text": "1.) Not the biggest on them but I think it's that I can't stand screamers in anything and it seems like every game or movie or anything scary I try just seems to rely heavily on jumps and screams and scare chords. But there are a few that stand out to me. Plus my favorite kind of horror can only be found in non-horror games, because what really freaks me out is when you're playing something simple and cheery like say Kirby! And then the game decides to throw some terrifying monstrosity your way, and then act like it was normal and nothing out of the ordinary ever happened.\n2.) By what I'm familiar with I guess it'd have to be Silent Hill.\n3.) 2 or 3, it's very hard to say for me as between the two if one is missing something I want the other has it and so it's a battle back and forth.\n4.) Pyramid Head, super duper slow. Although that said, Twin Victim doesn't do anything to you if you just leave it be...so I can at least turn around and go to another alley without worry of it following me endlessly.", "time": "4 years ago", "author": "Arc13", "channel": "UCRnY0rfgSJss0ObBuQciNEA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwEHbUhQ-89rVBAtMDkWRiBH21XbJHnST8Zm6SF=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggrRHM-kv_avHgCoAEC", "text": "1.yes \n2. Had a GameCube so by default, Resident Evil\n3. Silent Hill 2 \n4. Pyramid Head; intimidating but mad slow", "time": "4 years ago", "author": "XxWOLFRxX", "channel": "UCYNjN55NmPCpXsOVmc5aK7g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy5Kym5mEY7NBpdHn2Fz6sunLmRZBZLJUQcLw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjmqF-D2qP9CXgCoAEC", "text": "I do LOVE the Silent Hill series.  The music and the settings all made it great.  I just wish Konami hadn't become such a shite company now.\n\nAnyway, SH3 was my fav.  I loved the story and the music, especially.", "time": "4 years ago", "author": "BygPhattyPlus", "channel": "UCyY6TsRCmUoHf7VZ6g87Osw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyu83pTVL9gTIR-xt8-pmky9K6E58nE0VtnvYDzKg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggMv-F6F2XQYngCoAEC", "text": "1.-I enjoy horror games!\n2.- SILENT HILL OBVIOUSLY I freaking love everything of this so much that I would like to be engulfed by the town to be just there... with my melancholy... that's the feeling that this games evoke on me!\n3.- My favorite Silent Hill by far is the second one... with James Sunderland... omg that game blew me away, and the music is just too powerful...\n4.- Twin Victim is way more scary... but Pyramid Head is the best one in the entire series, although I don't like his appearence in other games, because it was James Sunderland's monster, not other protagonists... Silent Hill is supposed to materialize all your fears, feelings, guilts, etc. Into monsters that haunts you, so Pyramid Heads in other games have no sense at all.\nThanks for this upload, I love silent hill to death!", "time": "4 years ago", "author": "El Rincón de FinoRaptor", "channel": "UC7Dc2AWEDt2GNQOw2tc3gtw", "votes": "5", "photo": "https://yt3.ggpht.com/a/AATXAJzYemxTvJTaZ9Yl7kPNBulebxshsUdwMazP4fJ-=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgifT85eCSW0YHgCoAEC", "text": "Bueno....", "time": "4 years ago", "author": "6 A l l a h 6 P h o n k 6", "channel": "UCpPOvdc3_7rcmMacccwnSLA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxwTWKeE2HNqItCg3E2avWFsgy1xm9Y6HvJUc_qaA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugjvg4mrA3d3WHgCoAEC", "text": "While it's an unpopular opinion, my favorite Silent Hill is by far Silent Hill 3. I've beaten it like 8 times on the PC. I love the insanely detailed graphics, creepy sound design (its hospital is way scarier than SH2's I have to say), the story (I'm not a fan of SH2's story to be honest), the protagonist being a teen rather than an adult, and a female rather than a male, for a change, and the personality the protag has. Examining things in the game and reading Heather's thoughts on them was awesome, so much so that it disappointed me how much the other SH games didn't have nearly as much flavor text (except Homecoming, which I also like). \n\nSH3 was also the first Silent Hill I played, and I do wonder if that plays a role in my fondness for the game, but I don't think it overshadows the fact that I just straight up liked it a lot.", "time": "4 years ago", "author": "Daytime Sky", "channel": "UC92NMqb5TiODX4x5uHFW3nA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJw1Fj6WqstDDL8UIk1JNkQDfZV7p8CHRj9hzyYA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugjvg4mrA3d3WHgCoAEC.8CWHZwMEt0w8CX6AyuYI3b", "text": "+Daytime Sky It's not really an unpopular opinion. SH 1-3 were all great games. It's what came after that (mostly) sucked.", "time": "4 years ago", "author": "Clockwork Knight", "channel": "UCATNyBxvMrH5ccwl0ITp0Fw", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzbk-wCn4bialPWh1zsqnUQPmIPc-Zk_8xBxh-5=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Uggeun8m52w_RHgCoAEC", "text": "Loved this entry! One of my fave series period!\n1. Yes! I love Survival Horror games! One of my fave genres. We need more!\n2. Silent Hill with Fatal Frame a close second.\n3. Tough question, but I think I'd have to say 2. 1-3 are all pretty equal to me.\n4. Twin Victim. Pyramid is badass, but he's(it's?) fairly slow. That pointing plus the quickness of the Twin Victim is worse.", "time": "4 years ago", "author": "daneofurexistence", "channel": "UCh3jESXr3-xqo_sJ3I1qgUw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz4J37T2K4_VQMpT9C_Qwkl87RTioz3bSRqb78=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghV-tWqavstrngCoAEC", "text": "1. Personally, I'm not a huge fan of playing horror games. While I enjoy watching along while my friends play them, I don't really like playing them myself usually. (Unless you want to count Bioshock, which I guess isn't technically horror, but borrows many elements from the genre. I really liked that.)\n2. My favorite horror franchise is probably Resident Evil, only because I have some great memories of playing RE5 on co-op with friends. (Again, unless you count Bioshock.)\n3. I enjoyed watching a friend play the P.T. demo, but I guess if that's off the table, then probably Silent Hill 2 would have to be my favorite.\n4. Definitely the Twin Victim. No question.", "time": "4 years ago", "author": "Britton", "channel": "UCVnotA7a7xp2qbKwZMNffeQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx0nStRlQhXKkGVJKyC8fZuBqs4Jy4JST50SlY9uw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghUSffDt_rL8XgCoAEC", "text": "twin victims always made jump and feel cold when they approached you fast with those leg-hands", "time": "4 years ago", "author": "mesamus", "channel": "UCnlgyDdiFJh7OadCP7vgmMA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx_Knk3EC7koGB3-jmMtBFW0aG3MLKHbiI74w6BQg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghHIyJ6Znwi53gCoAEC", "text": "1. I love creepy games that do it well. But when they're just jumpscares n' shit it's pretty bad. Just like movies.\n2. Silent Hill, like you, ;o kissy faec\n3. I really enjoy Silent Hill 1, albeit it's the most inspired and takes a bunch of shit from other novels, it still brings an original nostalgia feeling of horror. With it's distorted noises and extreme fog and bad graphics. It makes me wish more people would make shit like that.\n4. Any of the Silent Hill dogs. I think I got a slight phobia of them after never seeing them coming in SH1, and when I first played the SH3 demo, I think. Also I got bit by a dog when I was 9/10 so that's a plus.", "time": "4 years ago", "author": "Glory Worm", "channel": "UCmVNJSox5QqWBr3tqI6H2KA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw5Km26F-PSVIXzxwKOdKdwABSAKXH04ra-Fd2S_g=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgigBy54sU7QJ3gCoAEC", "text": "I absolutely hate horror games, but that doesn't mean I don't appreciate the music from them", "time": "4 years ago", "author": "Yareyous", "channel": "UCNBj4OB0Xru9PpLOqMgat4Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxP5bRYTlxsuJ3lWGxGgLqQ5KoTNaHDo53vYPvV=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjY7A4rfmOBVHgCoAEC", "text": "Whew, I had to cram most of the hours doing this video today, I really wanted to get it done before leaving tomorrow so mission accomplished! While Fatal Frame 2 is the scariest game I've played, Silent Hill is quite easily my favorite horror franchise, so it's only fitting that it's the first one to get an x00 entry in the list.", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "16", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjY7A4rfmOBVHgCoAEC.8CWEBTTSN9Q8CWJP33Jy2D", "text": "Where you going supra?", "time": "4 years ago", "author": "Ghost Face", "channel": "UCPlpePfQRLr323QD249kJHw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzWGUurP1ig54bee5KYO8myGvJLyaFLFe5UI16a2A=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjY7A4rfmOBVHgCoAEC.8CWEBTTSN9Q8CWSC_FLZD1", "text": "+SupraDarky today I will spend the rest of the day with visions of shadow babies at the corner of my eyes. thank you very much.", "time": "4 years ago", "author": "RPGMel710", "channel": "UCEV9W8BIzXyAQ8NfLHA1zOg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJxTCNxddLEsz0Ej_LMyefzrvQLL_upWY0EFcg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjY7A4rfmOBVHgCoAEC.8CWEBTTSN9Q8CWWWLT2Xcs", "text": "+SupraDarky Thank you for doing that for us! I hope you have a nice time wherever you're going as well! ^-^", "time": "4 years ago", "author": "Aegis29", "channel": "UCKymmHM7V0jHeyZAK4qFVZg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxDr8y4XLhMMYsYzgootu2Neq8BBe47bdBNoQICKg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjY7A4rfmOBVHgCoAEC.8CWEBTTSN9Q8CWcemi7lNz", "text": "hey supra, i will recommend yet again indie game Mr Bree' soundtrack!", "time": "4 years ago", "author": "Lucio Fernandes", "channel": "UChO345Nzb1sNlOb2CCQ7XLA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzxldGVCzPDyGXGS1nu-LqjcnG-8ugsK0p1sqBrvxE=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjY7A4rfmOBVHgCoAEC.8CWEBTTSN9Q8CfWl6B00Pv", "text": "+SupraDarky Brother plz Resident Evil sountracks. ;)", "time": "4 years ago", "author": "jorgais reyes", "channel": "UCCDD6069p8ZNgTFY5jLNFPg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyjVYHe3OQTF9SV6kldmB6LRa8w5PFu7Su8F_KKpw=s48-c-k-c0xffffffff-no-rj-mo"}
