{"cid": "UgzvcNKFYmsFcl2OdWx4AaABAg", "text": "I always liked this song, made me feel that the world was a desolate wasteland, but with a glimmer of hope out there.", "time": "1 year ago", "author": "Rabbit", "channel": "UC90z1QIvPBOOtJJz3Xq7aTQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxQMIQi4FWx7Vsk8KNgkzn5VY1kvPybNtTSEVlu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiboVXJ1BjIiXgCoAEC", "text": "My favorite track in the game! For me, I first heard it in Goodneighbor, and it truly made the place feel like a safe haven.", "time": "4 years ago", "author": "Cinebeast", "channel": "UCltOmXkEEmsnAE912VxcKyQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwTWZuJv-VJu1eitRWqdPLrJWosd-GhULpcgxv5=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgifkewFpUiPnHgCoAEC", "text": "It sounds like the Hanz Zimmer song of Interstellar, maybe in even better ! There are other ambiantical musics like this into Fallout saga ost ? I thought that it was only composer by 30's 50's musics !", "time": "4 years ago", "author": "Un autre que moi", "channel": "UC9mtQKN-Zi3FNt2Sk-WS46g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwiBKxYujjlp53CN35abYq_QBUAZ34zeL-J-xz9=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggzLr_Q0eKeeXgCoAEC", "text": "This song was honestly my favorite aspect of the game\nThe only reason I would go to settlements at first would be this song, mainly for 2:00", "time": "4 years ago", "author": "Reindeerchicken", "channel": "UCe4uQK9L22Zsw6okzuFNFDQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwX3MR83_vIsF64Sks-XOQWxlRzVMNObuiIOBTg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjbVIiyZGVlT3gCoAEC", "text": "I felt this game was a big step down from previous games aside from the atmosphere and gunplay, such a shame for that wasted potential.", "time": "4 years ago", "author": "RoyalGreenTea", "channel": "UC83_K1r-YHGBNmut6Xbnqyw", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJy07P8BTOOebw91RL_Vg7eoCUpD7o2MTIbUBi3C=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgibI_MD0ArrSHgCoAEC", "text": "Witcher 3 was definitely the better game last year. In all phases.", "time": "4 years ago", "author": "alternine", "channel": "UCwn87R7XGR0UyqtLPNe0EAQ", "votes": "19", "photo": "https://yt3.ggpht.com/a/AATXAJyIkeQojunttI0vCHMHFmle7zet_xo2W_Ab0TAV=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgibI_MD0ArrSHgCoAEC.89McmnCwLVR8B9S0qBJe-N", "text": "+alternine I love Witcher 3 and Fallout 4, but i totally agree", "time": "4 years ago", "author": "TheWild", "channel": "UCdgz63r33mac2rl-CRjZSfA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJxwBE_Uu5jaYaeme5p0dhiaCz5GhzdHL140GSfV_Q=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugh0TXtws7iwpngCoAEC", "text": "Great game for someone who has never played a Fallout game, but not as memorable for fans of the series IMO. There just wasn't that many interesting characters, quests, or places. Still a really good game though. 👍", "time": "4 years ago", "author": "Scrappy", "channel": "UChN_lpssjriOvP_W5dPqe7Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw5LVUWZgsMasa75nBE0ejg2b1LhcbtnCsFzQmi-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggAtxlwyANktHgCoAEC", "text": "After 120 hours of doing sidequests, wandering the lands and scavenging materials, I was satisfied enough to go through the final missions and be done with this game. Fallout 4 is a great game, but I just can't shake the feeling that it could have been much more and much better, enough for it to be my favorite game of the year and one of my favorites ever. As it stands, it's a great, immersive game with a huge world and Bethesda did a superb job with their vision of a post-apocalyptic, retro futiristic Boston. The gun gameplay is quite a step up from the previous games and how the skill system works is interesting, eventhough I found most of the skills boring in their design. The game just oozes atmosphere, great audiovisuals making it easy to get lost into it. There's also some world building you can do, but I have to say I didn't have any interest in that. I did see some amazing things from other people on the net. The story is a definite weak point due to the amateurish, almost laughable writing and dialogue options (illusion of choice). Some of your companions are great (Piper, Deacon, Curie, Valentine come to mind), but their AI is terrible which often made me consider playing solo. Only a few quests are memorable since there's a lot of \"kill X\" or \"fetch X\" missions. There's a huge amount of buildings and sites you can visit, but a lot of them are way too similar, so I found the exterior world much more interesting. The inventory system is a disaster to go through and choosing the right equipment is made tedious by the lack of comparison stats with your currently equipped stuff. The lack of polish is almost expected with Bethesda, but the fact that Fallout 4 played it so safe in other departments means that they should have been able to spend extra time on polish. It's funny because I feel like I'm being very down on this game, but it's mostly due to frustration at how better it could have been. Overall, it was still a 120 hours well spent and a world that I'll always remember.", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "48", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggAtxlwyANktHgCoAEC.89MXUmCkb_w89MXl3w79p4", "text": "+SupraDarky Wall of text.", "time": "4 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "8", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggAtxlwyANktHgCoAEC.89MXUmCkb_w89MZ-uTshWY", "text": "+SupraDarky A great and thorough review of the game, I agree with your opinion wholly, and great soundtrack choice! :)", "time": "4 years ago", "author": "Katarina Du Couteau", "channel": "UCavk5v_QEWpY0QtZqPqlPJg", "votes": "5", "photo": "https://yt3.ggpht.com/a/AATXAJxA_xs4P8S12-euhu6bWcSFTNx3FyDN1Q_QAmdZ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggAtxlwyANktHgCoAEC.89MXUmCkb_w89MiG1bIf6m", "text": "+SupraDarky I spent about as long in the game but I walked away with a completely different evaluation. I'm not sure I'd even agree that it's even a good game. Anyway, nobody wants to hear about how a game they like sucks from some random internet person. Good music track, and as always you have a great selection", "time": "4 years ago", "author": "Catseman", "channel": "UCqudcJy6IbBIkegQehadiUQ", "votes": "7", "photo": "https://yt3.ggpht.com/a/AATXAJxipflGQSJYyEuDYDVrftvZuLfBpIyMln1zTbZs=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggAtxlwyANktHgCoAEC.89MXUmCkb_w89Mtf6zLmjz", "text": "+SupraDarky This really applies to the last several of Bethesda's games.", "time": "4 years ago", "author": "totlyepic", "channel": "UCGm9UBI_9JeBuY41-Hs88eg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwTR3Is6u9neOyiSAf0p8zj81itGYChq1DAXw=s48-c-k-c0xffffffff-no-rj-mo"}
