{"cid": "UgivDqUa-TOYVXgCoAEC", "text": "E3 2017 is now behind us! I have to say, overall I thought it was a weak year but it's probably the result of announcing so many great surprises in the past years way too early before their actual release dates: it felt like there just weren't many unannounced surprises left. I was particularly impressed this year with Nintendo and Ubisoft (Mario + Rabbids, BGE2 and other solid entries in established series). Microsoft's conference bored me and Sony's simply felt unnecessary, and it made me actually appreciate Nintendo's quick, direct format. Needless to say that Mario Odyssey looked amazing and with Xenoblade 2 also coming out, it feels unreal that we will get these games in 2017 after we already got a Zelda masterpiece. The nicest surprise had to be Metroid Prime 4 being in development (not by Retro!). There's Samus Returns for 3DS as well, though I'm cautiously optimistic seeing as Mercury Steam can bring awesome games like Lords of Shadow, but also mediocre ones like Mirror of Fate and LoS2. Exciting times ahead!", "time": "3 years ago (edited)", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "33", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgivDqUa-TOYVXgCoAEC.8U0-pz2fAYI8U02Kob_40F", "text": "agreed..nintendo kicked total ass at this year's E3. that still doesn't mean its completely okay though to have just a 25 minute showing for the BIGGEST yearly gaming show. Regardless, it's impressive how they wrecked the competition with such a short show lmao", "time": "3 years ago", "author": "Loose Goose", "channel": "UCB9oATBhIl_JofjWbBbziSw", "votes": "4", "photo": "https://yt3.ggpht.com/a/AATXAJyozUWzazlcrvOe-XrG4KiL8ITXXSz0Y9GkoJn5LQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgivDqUa-TOYVXgCoAEC.8U0-pz2fAYI8U078nNOncV", "text": "As someone who hopped right over the Wii U, everything about this E3 was exciting. Even something like Rocket League just being on the Switch is a good sign for 3rd party support, ignoring that I already own it. They must have really streamlined the independent development process this time.\nXenoblade Chronicles 2 went a completely different direction in art and visuals, but the soundtrack seems just as fantastic as the first. Might keep you busy.\nMetroid Prime 4 was completely out of left field (especially after Federation Force), and all of the iterative games seem at least good. Yoshi gave me Little Big Planet vibes, which was neat. Just as out of left field was Mario + Rabbids, really.\nI already knew about Mario Odyssey from early trailers and coverage, but it still managed to surprise me. I didn't think they could top Galaxy in gimmicky fun potential, planet-hopping about, but they managed it. Worries about the open-world aspects floated right away, it seems packed with content and they didn't use it as an excuse to shirk on level design or interesting things to do. The only thing left would be to see if it's challenging.\nFantastic E3. At least a B+ on the report-card.", "time": "3 years ago (edited)", "author": "Denied1213", "channel": "UCXmmxFqrd_DyWuycr298Wfw", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJykM9cZF3mTtVK7OWnh6QQkfgZsr3_WKdmjCS-u=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgivDqUa-TOYVXgCoAEC.8U0-pz2fAYI8U8vyLhSu1A", "text": "The best thing for me every e3 is without a doubt Nintendo's treehouse. You get to actually see the game instead of cinematic trailers that everyone except Nintendo makes these days. Many times you get to hear the developers thoughts about the game as it is being played as well. It is the best thing to happen to e3 in a very long time.", "time": "3 years ago", "author": "Eirian Odalis", "channel": "UC1aGPFAMbPS0lRf106rkEEg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxnFVPquEbxzSQusCupO6lVeKKSnrVzR1aizVqS=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugg2FjgbMGzHZXgCoAEC", "text": "Honestly my favorite track of the game.  Yes, even over Rundas Battle and Skyworld Elysia, which you placed on here prior.", "time": "3 years ago", "author": "Honatuto", "channel": "UCpI5fzJCqVAwIkHRW5r_jwA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzqpg2IHfktT6K--1MCR08l7uz5PDpLWEOhYacy=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi5UPJ68rwQxHgCoAEC", "text": "Wow, the dynamics -- i didn't remember this one.", "time": "3 years ago", "author": "Junk Genes", "channel": "UCXGIyVX2gucvLsybWzUxcRQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJz1m4ckbgr2iwth9sg13X_VNT0REAVhGWR59YQj=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugi5UPJ68rwQxHgCoAEC.8U0yETVHUwa8U4jyEjfkv1", "text": "This is one of my favorite tracks from the Prime Soon-To-Not-Be-Trilogy. Most of the boss fight music is hardcore \"shit is going down\" stuff, from Parasite Queen to Omega Pirate to Dark Samus to Rundas. But Gandrayda's is more low key, creepy, and unsettling, very fitting for a shapeshifter. Also the fight itself is annoying because you probably have three tanks of energy going into it.", "time": "3 years ago", "author": "David E.", "channel": "UCJNsvh33KhHeROeelPRtbEA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzcqXIZ8lDIxJJB9wEi63195Z14bknK7aLhyqJyog=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgiZ7AGCQo_WE3gCoAEC", "text": "She is back!", "time": "3 years ago", "author": "Boy Next Door", "channel": "UCxiulO5glyRgYylOeGHeSRg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxWAZWzW8vZECECeAvy8DJLGru-KafXSFKG5XrX=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UghcMNwp5CgISngCoAEC", "text": "whoa, that's odd, I just started prime 3 today.", "time": "3 years ago", "author": "Enderbroseff", "channel": "UCLebZ3g21cN_SliFrqmiE-A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzDw5XSRaHj7WXEdHybCezlj078ZMubzpyKkXg1=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggZl0Q3Va8hiHgCoAEC", "text": "I've been waiting for this track for a while. \"You should never trust strangers, Sammy\" is on the Jill Sandwich level of all-time cheesiest video game lines.", "time": "3 years ago", "author": "David E.", "channel": "UCJNsvh33KhHeROeelPRtbEA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzcqXIZ8lDIxJJB9wEi63195Z14bknK7aLhyqJyog=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgjzyN-m7Y8ANHgCoAEC", "text": "If I remember correctly your Best VGM 02 is also a Metroid prime theme", "time": "3 years ago", "author": "Augustine Vega", "channel": "UCAa_nex_QwG9ABgVfGo9yMA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJycwSv1Ay496RPiF-Uj0dwIUbkkJSFYsqZc53M6=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UggJGZnmBPTHLXgCoAEC", "text": "Weird timing! I'm currently playing Prime 3! Great game, even if the motion controls piss me off more often than not.", "time": "3 years ago", "author": "jb1980ist", "channel": "UCWqHkBmEmluR-GbjUGxaN8A", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJyCBa_FcRN-5g57hzxQW3K3LyoN79sLn9eG-plh=s48-c-k-c0xffffffff-no-rj-mo"}
