{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg", "text": "I will be playing this game this year and I don't want to spoil the music before that, so I only listened to a couple tracks and it's sounding very good so far (unsurprisingly). I am glad they brought back the first game's composers, mainly ACE which I still find vastly underrated. They should be composing for many other games. Interestingly, I see that Hiramatsu who is part of ACE+ composed solo for this game, thus the game crediting him separately and ACE without the +. I asked for Persona 5 and I will ask the same thing here, how does this one compare to XC1?", "time": "2 years ago", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "34", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e49q1kLL6N", "text": "How does it compare in what way? just the music or the game as a whole?", "time": "2 years ago", "author": "Katze", "channel": "UCrOolD_ppK9DSfgZzQ8Dy5Q", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxndew_3v9P_0qWuTaTJ7Il3fzDu70hYqlFGgi_RA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4BlVBjNT5", "text": "SupraDarky many people say it's worse than or Equal to XC1, but in. My Opinion XC2 is better and I'm in that train with at least 1% of the Fanbase ( I'm not actually sure how many people like this over XC1)", "time": "2 years ago", "author": "Ceretor", "channel": "UCF_E4D1OaWGVO0dtz3dgfkA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJzck3z1aw5VaifGie-B1reHv8lCRk5yeeND-2-7NXY=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4Buopets0", "text": "It's a good game generally. Not as good as XC1, after a couple more tries I'm certain XC1 was just a lightning in a bottle situation that won't be quite replicated.\nThe gameplay is much more similar to the first game with a world as expansive as X. If you liked the original you'll likely enjoy this.\nHowever as preparation it has a few flaws. Tutorials are important as this is a more complicated game and unlike the others for some reason you can't go back and reference things so if you think something's particularly confusing screenshot the instructions.\nThe other problem is sadly the same as X. It's odd seeing as XC1 had it nailed down. As you know, enemies of varying levels roam the world. But similar to X many of the stronger enemies easily agro and decide to charge you so you need to be careful of that.\nOther than that it's fun. The game is far more anime than the others and as a final pro tip, until you have 3 party members just go ahead and play right for the story missions don't bother with anything else as otherwise YOU WILL DIE. Hope you enjoy the game!", "time": "2 years ago", "author": "Arc13", "channel": "UCRnY0rfgSJss0ObBuQciNEA", "votes": "4", "photo": "https://yt3.ggpht.com/a/AATXAJwEHbUhQ-89rVBAtMDkWRiBH21XbJHnST8Zm6SF=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4CTurO7y0", "text": "SupraDarky Very different games in every way, however expect lots of late game twists. I loved this game a lot, and possibly more than the first one. There's lots of debate over which voice acting you should choose, mainly because Rex's voice actor is questionable. I'd recommend English though because the Japanese voice acting doesn't offer anything special or unique. The English acting has lots of fun and unique accents that bring great personality to the table.", "time": "2 years ago", "author": "Augustine Vega", "channel": "UCAa_nex_QwG9ABgVfGo9yMA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJycwSv1Ay496RPiF-Uj0dwIUbkkJSFYsqZc53M6=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4Ch3-jmsx", "text": "Arc13 I wouldn't say 2 is at all expansive as X because X was completely open world. This isn't.", "time": "2 years ago", "author": "Augustine Vega", "channel": "UCAa_nex_QwG9ABgVfGo9yMA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJycwSv1Ay496RPiF-Uj0dwIUbkkJSFYsqZc53M6=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4Cla-5t3Q", "text": "Arc13 I pretty agree with everything else though", "time": "2 years ago", "author": "Augustine Vega", "channel": "UCAa_nex_QwG9ABgVfGo9yMA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJycwSv1Ay496RPiF-Uj0dwIUbkkJSFYsqZc53M6=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4DBR-g0EH", "text": "I liked Xenoblade 2 a little bit better than the 1st and I LOVED the 1st mainly because of the battle system, blades & all the new systems/mechanics they added to the game, the characters both protagonists (I hated Rex though) & antagonists are great! The thing that I find amazing though is the world building & the lore in general, Monolith exceeded themselves here. The story is good but it won't show its full potential until chapter 5, the cut scenes especially were amazingly directed!\n\nWhen it comes to the music, it's a tough choice but I can say I liked Xenoblade 2 more, there isn't a single track that was even average. The dub wasn't that good, even though I love the different accents but the delivery wasn't that great for many characters. Hope you enjoy the game :)", "time": "2 years ago (edited)", "author": "Super Fox", "channel": "UCpOCZCrqWq650Vt7kxbL8tg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwhMMY90PjaVDkgohujL1JhZ1nvRIqIziRJCEvg2w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4DSklkYZC", "text": "The game was okay. I didn’t like the story or characters very much (especially compared to XB1’s more grounded and mature cast) and thought a lot of the mechanics were half-baked. Music’s definitely an improvement though, if only for the production values.", "time": "2 years ago", "author": "jb1980ist", "channel": "UCWqHkBmEmluR-GbjUGxaN8A", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJyCBa_FcRN-5g57hzxQW3K3LyoN79sLn9eG-plh=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4E4bd2ojh", "text": "Music-wise XC1 has more heavy hitters, but XC2 has overall a much better OST. Every song is amazing", "time": "2 years ago", "author": "WallStaple", "channel": "UCpOeNxf6WuUg_FUFUtwkScA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJx8qMOrW3dsB8UweeJQptshmlfGQ2SHySrRUk31GQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4Ec9qTQQj", "text": "I haven't played it yet, but just from the looks, it is \"too anime\" for me to really fall in love with it. XC1 was just so fantastic in so many aspects, even with the Wii's hardware limitations. That said, the general opinion is that XC2 is a very good game, so certainly worth trying.\nAn odd thing to wish, but I'd absolutely freak out if the developers would ever announce a remake of XC1 in the same quality as Shadow of the Colossus got one.", "time": "2 years ago", "author": "Fak Yuh Googel", "channel": "UCQtb7I651yRJIbJ6BkFfXCg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyaoiDPBsIQGx1iV0CXFrXHQmIra6fHxBiXHQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4F2T1Q7Bi", "text": "The two are very different games...this one definitely feels like a xenosaga/gears game. I personally think it's the best one between all the nintendo xeno games but like the others it has problems. This is much more of an anime jrpg than other jrpgs. That said I've enjoyed the hell of it despite its flaws and will be playing it again once all content for the season pass releases.", "time": "2 years ago", "author": "Phantom Thief B", "channel": "UCpEcIRHu039i3Rdwa5eTeHQ", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJzlskVL7u5JoiujWhqjic-ILoUrdA3wUhATJoGI=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4KiDD_GeK", "text": "In XC2 you have more real sidequests, these are not great but good enough, way better than in XC1. XC1's music i imho a lot better but the music is similar. The most glaring point for me are the characters and the digusting and unneeded fanservice. The fanservice always distracts from the often serious story elements and makes them in hindsight worse. The characters and this is only imho are alle worse than in XC1 but only a little worse. I didn't like the look of the main character, he has no appeal to me. Still love both games very much.", "time": "2 years ago", "author": "crono686", "channel": "UC4dW8NPLdpCS8si65jE78BA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJz4uAwoUu2D88nGJCBW7AToDnWm2R0KtzDbJA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4Us9_bajj", "text": "the best Monolith game yet.", "time": "2 years ago", "author": "Ezra Laguna", "channel": "UCwa4hG6vxUvwVoXUMfv2vwQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzZCaGroG_0lSNzDcB8HJ7Aj2U7B64na94f=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4Xj4Ss9xM", "text": "I finished it last week after almost 100 hours of playtime and I love it: if you liked the original Xenoblade you will defenetively love this one too; it have some flaws, but are the sames of the first episode(sidequests for example: a very lot of them, but almost of them will ask you to bring item, kill monster, reach a location etc.; still, a lot of them have a solid backstory so they are not completely boring), so if you're already accostumed of that you will not find major problems; if you find the first half of the game's plot a bit slow\", is because it's work is to present to you the world, the nations, the people and the rules of Alrest, but when all the pieces of the chessboard will be in line, the story will amaze you even more of the first half.", "time": "2 years ago", "author": "Kyvel85", "channel": "UCamLJE1zQlKoTt-9tF6C0SA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJylTgV6qFNSQF46VPc-duG_ouukvOye1VFdkLsW=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4_CSfEyH0", "text": "This game has the unfortunate position of being a sequel to 1.  I think people wildly underestimate how good 1 is.  1 is my favorite JRPG of all time and I consider it a masterpiece.  I'm not going to require any game to clear that bar.  Pile on the fact that this game doubles down on the anime and has a combat system that requires some homework on your part: It's unsurprising that the word \"disappointing\" keeps appearing in reference to such a phenomenal game.", "time": "2 years ago", "author": "cinnabon suppository", "channel": "UC2PCM1LT8h2gqBYrktp2YZg", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJycQ5fwjG64MiU_UmzvjcqZHYjUCRbnSOsVcoCwPQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e4dN3X1gDp", "text": "I thought the story and characters of XC1 to be much more enjoyable and executed better than XC2. The subplots and character arcs of XC2 were the motivating factors to push forward in the story rather than the main plot, which I thought hurt the cohesion of the story as a whole. XC2 is still very enjoyable in these areas, just not quite as much as XC1.\nThe battle system of XC2 is really, really fun once fully unlocked. XC1 characters each have defined roles in battle, whereas XC2 characters excel in a specific role but can fulfill the other ones too. It differs enough from XC1 battle system where the two can't be properly compared because they feel so different.\nEverything else about the two games feels pretty equivalent. I'd say your enjoyment of XC2 will be very close to XC1, lower or higher depending on your own tastes.", "time": "2 years ago", "author": "Ceven", "channel": "UC1kn6Fmr-GK51SZOiQmlMCg", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJw-A_dpBAFiopyEfD2rkaGZL-uPnu3cFDGykg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e52RsjpuoW", "text": "jb1980ist I can agree, however in One the side characters got entirely washed out, while every character in 2 stayed pretty relavant.", "time": "2 years ago", "author": "Augustine Vega", "channel": "UCAa_nex_QwG9ABgVfGo9yMA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJycwSv1Ay496RPiF-Uj0dwIUbkkJSFYsqZc53M6=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e53MPvj5SA", "text": "It's a good game alright, but compared to the first one it's just a lesser version. Soundtrack is too similar to XC1, many things in the story is too similar to XC1 etc. XC2 lacks its own style, and when it has its own style, like the character designs, its horrible imo. The main character has unfortunately no character development at all, and the game is filled with so much fanservice that it's off putting. I like to compare this game to Fire Emblem Conquest. A good game, but all of the fan service makes me not want to play it, and think of it as a lesser version of prior installments. \n\nUnfortunately I cannot recommend this game to anyone since XC1 is out there, and I don't know if I think it was worth playing through it because it took me so many hours. XC1 was so good that I felt like I could always trust Monolith in making groundbreaking games, but unfortunately all my Monolith hype has ended with XC2. In the future I will be very careful in buying another Xeno game. I don't want to stick around with awful, generic anime characters with waaaay too much fan service in the future.", "time": "2 years ago", "author": "YolmzWelra", "channel": "UCcxP4pv0xYTAaRu8rPK3wTg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwi3drrIDlEZqxNvS5nujXiODrIrXak1B-WSrM=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e56aoAqMyt", "text": "Since you've already played XC1 I would say don't play this game unless you're a fan of anime with a lot of fan service and all of anime's overused norms. What's interesting in XC2 story wise has already been covered by XC1. For me, XC2 just left a bad aftertaste, which feels kinda bad for me to say considering XC1/XCX are some of my favorite games to the Wii/Wii U.", "time": "2 years ago", "author": "Eirian Odalis", "channel": "UC1aGPFAMbPS0lRf106rkEEg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxnFVPquEbxzSQusCupO6lVeKKSnrVzR1aizVqS=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e5IuR-_yKn", "text": "SupraDarky \nI personally enjoyed 2 better than 1.  I love the story elements of 2 more, and I really think the characters are more well-rounded too.", "time": "2 years ago", "author": "ZeroChill", "channel": "UC0VG1k0Unt7tkfhNGkVDilw", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw9RSnml-TKKQTZBSwk7p0yIMnzNvXr3cAMa9f_=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e5QOL09QHq", "text": "music wise I find it to have the same quality of XC1 both have huge OSTs that are excellent.", "time": "2 years ago", "author": "7md", "channel": "UCX7Sp1jtN4cEcoFP5-hLSXQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyvC_EkFsNzPCVSWvRYCkdqxYzEh9lYw8wXahIk9vo=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e5gcg8tva3", "text": "I actually liked it more than XC1 for a few reasons.  Combat is IMO way better and stream lined.  People complain about how long it takes to feed you the entire system, honestly it gets pretty complex so I am glad it was drip fed because my head would explode if they shoved it in your face in the 1st 15 hours.  The music and characters are also a reason I like it more than XC1.  While I enjoyed the world, XC1 just seemed to have a more cohesive world with just 2 titans that I found better IMO.", "time": "2 years ago", "author": "gremjs03", "channel": "UCXBuoyvr9YSrRcKPkAX0_Ag", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJxLpVcCg7yJc81mBBq248u-ViPj-LZNcw8j-5bw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e5vrbGaWLm", "text": "At first i didn't like it as much as xc1, but it grew on me and by the end i think i did like it more. I'd say the story wasn't quite as good as the first, though it was more developed. The characters felt like they had more depth in xc2 and the soundtrack  had more good tracks than the first (though many tracks felt directly inspired by ones from xc1). The english voice acting was a bit spotty, but i actually grew to love its quirkiness.", "time": "2 years ago", "author": "ragnaroktomorrow", "channel": "UCje5lthydq7ycRifvCzNxog", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJxXgBiAm42Nel-j8mhe0mnELWIJIr7xriysO6tNRA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8e8S22NXc_E", "text": "I think XC1 is better but XC2 is pretty good by itself. I went into 2 not thinking I'd like it at all but I at the end I felt satisfied with it. Also this song is from a REALLY late game area, I hope you only know the name cause that area is spoiler heavy.", "time": "2 years ago (edited)", "author": "Gavin, That Wolf Wizard", "channel": "UC3d55UvuweXPpaorBkW1ALg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwaPrR8GaVXmbVVLiocxLWRpkHb1afu5SUd-fKDAg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxgWMi2jUm4ZZvpUht4AaABAg.8e49JJsmCNf8qBxbx0yMRS", "text": "SupraDarky What are your thoughts of this song now that you’ve played game, in comparison to before?", "time": "1 year ago", "author": "smoothponz", "channel": "UCcYJYIpQcCVTHz4isyaS5og", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx6CK_PX6fv1tDLjVHH20IkXAVVTMdpuixBxYj9rQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgwgnOTGqCDcfdAVsIJ4AaABAg", "text": "The moment you end up in Morytha you realize the horrible truth..\nHUGE XENOBLADE CHRONICLES 2 SPOILERS INCOMING!!!\n\n\nAlrest is Earth.\nOr rather what remains of our planet after the experiment with the conduit that also kickstarted the events of Xenoblade Chronicles 1...", "time": "10 months ago (edited)", "author": "Recht_voor_zijn_raap", "channel": "UCX57ZxCliKNhpy4-Zjiv1dA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJxZlwRLRQwESQuvoaszn-P9Hd-JRun7hLdUYWCuYQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgxmlvjgpYreEBEsccx4AaABAg", "text": "The violin is captivating and powerful... but the vocals add so much sorrow :( I love this piece!", "time": "2 years ago", "author": "SirenoftheVoid", "channel": "UC28BGhO0n6e02aIpgdZEI1g", "votes": "4", "photo": "https://yt3.ggpht.com/a/AATXAJycAWcpiHL-uEZ_RxR2Cr50pcmhR1mXZsXmwx0K=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgybFm5H7zW0Ed_rqFR4AaABAg", "text": "I have an OST list too\nWatch Mine please\nDaily VGM List: https://www.youtube.com/playlist?list=PL0U93OwjD1DJHT7_cIF2n6y04HFe0lVBq", "time": "2 years ago", "author": "Karlos Katu", "channel": "UCYwOJfYABfqjnB0Dqg-MLOQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwwzTp7jeveL12j33MGTH2JR0uT6CGb06oP6tB7aw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugxi6Nk8bzHMrkReb4d4AaABAg", "text": "THIS WAS A TRULY SPECIAL GAME - PLAYED IT 75 HOURS....WON'T FORGET THIS ONE EVER", "time": "2 years ago", "author": "StevenTravelCaptainRogers", "channel": "UCICgh48ZTAz0eBo49IlVXCA", "votes": "4", "photo": "https://yt3.ggpht.com/a/AATXAJx0sUdxk697rS5VnioXPyc-wczPPFq79TNuktGC=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgztjDnEGntVr_G8KFh4AaABAg", "text": "I play this game whenever I can and I am only past 50%.  I want to try new game plus in the future, but the music is just so good for grinding cores.  I wonder if I should just rush the game to start anew", "time": "2 years ago", "author": "Hex Maniac", "channel": "UCwgjNUZry_JRblFSpUMxpug", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwJslJm2PY-lZFd22_Cbn9V7GWbOk7wrez8OpD8YQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzeXX4sWnMwjAraWTx4AaABAg", "text": "This somehow reminds me of a classical composition Ciprian Porumbescu - balada -->>>> https://youtu.be/VzBXJB_otlc", "time": "2 years ago", "author": "cravis123", "channel": "UCccFYUJN-pG9Hdfxy0ZDLCA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzYDTitl6_izrN-lqk5GDR8oRONCLvANNVyLPPl=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgwHaX_V2kLM8f1_90l4AaABAg", "text": "wait till you hear Theosior's (Day/Night) music. I think those two are the best tracks", "time": "2 years ago", "author": "cdgammer", "channel": "UC8DI2uQ6cPl-OPkxO32tPpg", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJz6BTky0I8Bq-tRjuGGNsp4kMmKR_QpDXIj-d7L=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzzDM_OvtRkfHfZKiN4AaABAg", "text": "I'm a sucker for a great violin, and the performer in this piece kills it. It's rather sorrowful, and it makes me wonder what could possibly be the background for this piece. Where are they, and what are the circumstances. It also makes me think of all of the quieter moments in XC1 where you are hit with the reality of how derelict and hopeless the world can be.", "time": "2 years ago", "author": "BombOmbBuddy", "channel": "UCnSAWSK9ZVJJpTE-ClOQyVg", "votes": "8", "photo": "https://yt3.ggpht.com/a/AATXAJy7iTY5ulaLq6bgDUKJ1GKyR1EXmIlzoHlAiEVE=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzzDM_OvtRkfHfZKiN4AaABAg.8e4sDKra0ni8hlGX_49JoA", "text": "OOOOOOOOH How did you find it? I'm assuming you have played the game now. This section was one of the best parts for me.", "time": "2 years ago", "author": "Ambassador Of Mercy", "channel": "UCvEakTbjwhFtMbkbvHbKz-g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwkGzpW2ZxHD9My-M2DldhiWsNFdbiyhmd6Os-0=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugz4vi6C8bms0PtvEWR4AaABAg", "text": "Around 30 seconds in i'm getting Ludwig flashbacks from Bloodborne! lol Very nice composition.", "time": "2 years ago", "author": "Ig_needs_a_wig", "channel": "UCc0eYuRY2Y3poiN4xNBGE8A", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJziNzCdYMVO1hwlGYpsf3_6Ypo3UE3a0x-DlA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugyz-YHyNcTwGSJFIdp4AaABAg", "text": "NICE. If there was any track I would have picked to go on your list, it would have been this one. The area where this plays is definitely the highlight of the entire game for me, and justified the slog that came all 6~ chapters before it comparatively", "time": "2 years ago", "author": "Timman97", "channel": "UCjEmrOYFULRJf8pd2URV05w", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJxAjV7hl4pZ_gWZE8cJNgsSry5xHJkDMfyaeh7A=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugzsy1IPRR2mZxx6elh4AaABAg", "text": "Sounds like the soundtrack to an HBO show", "time": "2 years ago", "author": "Reavengence", "channel": "UC4YBLUQGUm_N_kfhkPTRp_Q", "votes": "5", "photo": "https://yt3.ggpht.com/a/AATXAJzplnTm3No2Biiw0emZrjc-hqeYOKtuVEA8LIH0=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugzsy1IPRR2mZxx6elh4AaABAg.8e4Oyjjyr0N8e7HQEGX_YB", "text": "Reavengence Game of Thrones", "time": "2 years ago", "author": "Recht_voor_zijn_raap", "channel": "UCX57ZxCliKNhpy4-Zjiv1dA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJxZlwRLRQwESQuvoaszn-P9Hd-JRun7hLdUYWCuYQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugx6jbny5kFkUNzgGI94AaABAg", "text": "Love this ost ! By the way Land of Morytha is my favorite location in Xenobblade Chronicles 2 . Some times Land Of Morytha reminds me a destroyed future from Chrono Trigger !", "time": "2 years ago", "author": "Arteg Bulba", "channel": "UCtbKg7scqY5QEDe6ibyufJA", "votes": "9", "photo": "https://yt3.ggpht.com/a/AATXAJy9OX8tbjMlRlgar7GcaIvMw750YZxfIg9aGQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugx6jbny5kFkUNzgGI94AaABAg.8e4FniL66hx8e4SzzdLzPO", "text": "Arteg Bulba absolutely, I agree with that comparison", "time": "2 years ago", "author": "Timman97", "channel": "UCjEmrOYFULRJf8pd2URV05w", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJxAjV7hl4pZ_gWZE8cJNgsSry5xHJkDMfyaeh7A=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugx6jbny5kFkUNzgGI94AaABAg.8e4FniL66hx8sKoHg_grmf", "text": "Same for me, also chronopolis in chronocross...", "time": "1 year ago", "author": "ⴰⵣⵖⵓⵖ n Iɛessasen", "channel": "UCfH6bffVCycnw8pykdjuLXg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJy1BEbv3FI3PMPvdb9XaOe8X-ArX5VOrzLPT5ue=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugw4-6y8NSPK5WfiH094AaABAg", "text": "thought it was Fable at first!!", "time": "2 years ago", "author": "Austin Willis", "channel": "UCa4Sy2P6yKlTDADv3yVXBRg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJz4eUpSFIdUrWQ1QtJ3ttc_O2YModyQeknkFotQhg=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzOc8Jjaumz2IuiOqp4AaABAg", "text": "God I love this game", "time": "2 years ago", "author": "Augustine Vega", "channel": "UCAa_nex_QwG9ABgVfGo9yMA", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJycwSv1Ay496RPiF-Uj0dwIUbkkJSFYsqZc53M6=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugy3DUcsGs6hao06s514AaABAg", "text": "I don't like this game's OST as much as XC1's, with a few exceptions, like this track and Mor Ardain, but it's still operating at a high level of quality. Also, while the game itself is hit and miss, there are some very poignant segments, like where this track plays.", "time": "2 years ago", "author": "Joshua Fagan", "channel": "UC1Wyw1N5Gv4IPSI7vztW1Ow", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJy9w3QlCFx6bD15gMCkFYUPN6oN65DH0zAgxhBZQpU=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugx0i64D-ffuC_u2Cdd4AaABAg", "text": "I have not yet bought this game yet, but I will at some point once i get through some of the other rpgs that i have on my backlog currently.  I loved the music in XC1 as it is one of my favorite soundtracks of all time.", "time": "2 years ago", "author": "Eric C.", "channel": "UCW-NCSWtwr76dBreDd6jAYw", "votes": "5", "photo": "https://yt3.ggpht.com/a/AATXAJwZUTZb5cKg6joDbmEtTsOCxELWMYvBf92-CCID=s48-c-k-c0xffffffff-no-rj-mo"}
