{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg", "text": "Powerful theme, I especially like the section after the piano and voice come in at 0:58. Astral Chain is my #11 while also being my biggest disappointment of the year. I truly had high expectations from the very first reveal trailer and I had a feeling it would end up being one of my top 3 games of the year, it just seemed right up my alley. The biggest positives for me were the graphics, the oozing \"Platinum\" style and the last 20% of the game. Apart from that, I thought it started badly with the motorcycle sequence and then had severe pacing issues that really disconnected me from the main story that is below average in the first place. Having a silent protagonist sometimes works, but it makes zero sense in this game to the point where it hurts the experience. The side-missions were uninteresting (and sometimes frustrating) and the combat system started great but became overly convoluted, which means I ended up sticking to the simple combos (especially with the auto-sync ability). I barely used the chain mechanic. This game also made me realize something about Platinum even if I'm a big fan of them: a lot of their games have that empty world/corridors feeling but are usually saved by amazing combat. I may sound very negative on the game, but it shows how high my expectations were. Again, I really enjoyed the more focused last 20% of the game. I ended up liking the game more than the sum of its parts and hopeful that we get a sequel that builds on it because I truly think the setting has big potential.", "time": "5 months ago (edited)", "author": "SupraDarky", "channel": "UC6iBH7Pmiinoe902-JqQ7aQ", "votes": "26", "photo": "https://yt3.ggpht.com/a/AATXAJz-WP37CKyRsSGpodj0KF2a556urv8yhxQQEuPB=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94v66Q9OGqF", "text": "SupraDarky Since Nintendo and Platinum pushes this so much, and the game did well enough in sales, I think they will launch a second game.", "time": "5 months ago", "author": "Chazz Flowers", "channel": "UCylqBW0awssN_E6nNB8F5jA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJx_lPNGqGKwdcO4Zop_n-Dw4u1PZ0HkSV2hoQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94v7ZjYlzfx", "text": "I kinda agree with that. Some things were underwhelming, including the length. And the missions aren’t very fun", "time": "5 months ago", "author": "Zephyr", "channel": "UCKrmZPEjFYQYzMB891Ebp2w", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx5cT6g_l01fuTMS52wEvUdGlc5AEapL4pU7Dn4lw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94vFNhCTQH-", "text": "The funny thing is that I finished it only a couple of hours ago! I agree with the letdown of some missions, the story (TOO MUCH japanese in both storytelling, recitation and cliches)and the characters: making the protagonist silent was a bad idea, hearing him making just random noises during the most intense part was just cringe AF..still, I enjoyed it a lot, the combat is good and deep when you get the hang of it, but it needs more polishing and a combo meter just like Bayonetta/DMC and I'm pretty sure that with a almost certain sequel Platinum will make a better and more polished experience overall.", "time": "5 months ago", "author": "Kyvel85", "channel": "UCamLJE1zQlKoTt-9tF6C0SA", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJylTgV6qFNSQF46VPc-duG_ouukvOye1VFdkLsW=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94vvDgXtm41", "text": "Damn King, couldn't disagree more. Tho you're spot on about the silent protagonist and the story. I would also like to add the iffy framerate and the weird lock-on system. But besides that, the game is easily at least an 8.5/10.", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94vvSgDctmh", "text": "@Zephyr \nLength? This game takes about 25~30 hours for the story, 50 for doing all the extra content.", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94vvcx4nRid", "text": "@Gaming will NEVER be good again I guess making a spot 11 in best games of the year would equal an 8,5 already", "time": "5 months ago", "author": "Sandro Vadacca", "channel": "UCl3CEEPexGKiqEP1efjXFKg", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJwiY5O7RIZ1Is5kkV1uyw8u1Q2wmajsaKG3lw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94vz99Br9WD", "text": "I liked the beginning as a bit of a \"set-up\" with the motorcycle chase and the introduction to the world. I still think the setting and world-building are the best parts of the game and actually carry the story since that falls flat with the plot points you see coming from a mile away and pacing issues. Not everything needed to be explained and I did actually like reading the lore from the computer about the places on The Ark, but literally some parts of the story were just never explained for a good reason. For example (SMALL SPOILER), the figures that Yoseph Calvert talks to in his meetings early in the game. I had a feeling they were supposed to be important, but were ultimately cut out. The silent protagonist usually does not bother me, but it REALLY did when I learned that whoever you choose \"loses their voice\" and becomes the player character. Might as well go the extra mile and include their voice as it would have absolutely made some of the more \"anime\" moments hit better.\n\n\nThe soundtrack was pretty baller though and this is definitely one of the highlights because I really liked the range from the chill EDM to the epic rock orchestral songs. I had a great time exploring the world, but I really wish there was more meaningful content to do out in the levels as you get tired by the third act of the game. The game uses its colour palette really well with bright and expressive visuals, and the whole cyberpunk police, dystopic setting is my jam. Though, unfortunately, it did not feel that way for the whole campaign as I felt obligated to keep using the I.R.I.S. to look out for secrets or important things like upgrade materials. I.R.I.S. is the \"game-ified\" UI of the game and a scanning tool that is initially cool, but quickly becomes bothersome when it feels more like a necessity rather than a tool in your toolbox - at least to the extent of trying to get everything. If you don't care for that, DON'T worry and enjoy the scenery. The views are great, when you're not fighting the camera both in and out of combat.\n\n\nHowever, that may be the completionist in me burning myself out too fast because I took around 45-50 hours to beat the game and I did almost everything possible on the first run (rightfully so, many content you have to go back for when you have abilities to access that other content). I am not expecting side quests to be like from what I hear how the Witcher 3 is (super high-quality), but I do expect them to at least be somewhat engaging. Some of the characters actually had good story arcs like the dude on the rooftop who does not like the Legions. Although a pretty standard story arc, it is delivered well with the variety of missions and interactions you have with them.\n\n\nNow the most important part, for the combat, I actually think it is quite strong and can be expanded upon in a sequel. The chain mechanic and gameplay felt \"meaty\" and responsive, but a little weird to get used to if you played other Character Action games that use face buttons instead of the triggers here. Something important to note is that the frame rate is rather dodgy in both docked and undocked, definitely noticeable on an action game already at 30 FPS. The fluidity and style of the combat are trademarks of PlatinumGames with concepts borrowed from Metal Gear Rising: Revengeance to NieR:Automata, but I think people had the misconception of the game being combo-focused as it is not really about combos. This is not really the fault of the player as it's hard to get all the abilities and upgrades that make the combat meaningful at the start and even up to the middle point. Also, the difficulty does not have the curve you'd expect on Normal difficulty. I can admit that I am not the best at these games, but fights just felt really imbalanced with how strong you are compared to how hyped up the bosses and introductions make them. However, this changes in the final act of the game and the difficulty spikes up quite hard where I actually started to die and use the limited resets per mission you're allowed.\n\n\nUltimately, I enjoyed my time with the game because the setting and world-building coupled with the soundtrack and, eventually, combat were pretty well-polished and satisfying to get into and learn. But the technical difficulties with frame rate and camera controls and story beats just not hitting like they should are what disappointed me the most for this game. Also, the difficulty of the game scales weirdly as the beginning and end are noticeably much more difficult (for different reasons) than the middle HUGE portion. Normally this would not be as bad because I don't expect god-tier stories from PlatinumGames, but the amount of cutscenes and exposition your given really pushes you to try and engage yourself with this poorly-paced story. However, the groundwork and other portions of the game manage to make up for these faults for me and I still can recommend it to people despite my issues. I really hope, again, that it gets a sequel!\n\n\nTL;DR - Fantastic setting and world-building; potentially great combat that is held back by frame rate issues, camera controls, uneven difficulty curve, and slow progression of unlocks; for as much focus the story gets with cutscenes, dialogue, unexplained parts of the story not resolved (that had no reason to be left open), and character interactions it throws at you in the Hub area, it does not deliver well enough to impact you as they probably hoped it would; silent protagonist kills a lot of the feeling and attachment to the story, especially since they are BOTH voiced depending on which protagonist you pick from the two; many potential improvements could make this good game a great game with a sequel because it shows a lot of promise!", "time": "5 months ago", "author": "GamingNobility", "channel": "UCOVBsLKQkev_c48LIIFn9KA", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJwVqYebOjCQAWGB71qTS75C3sfd6Hq0A9KnK1Yu=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94wTHDaY2Ns", "text": "This sounds an awful lot like a review of Xenoblade 2", "time": "5 months ago", "author": "TimBagels", "channel": "UCnpfor3wUnncrOZ3QX8eS2A", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJwdfHRyVe5fdbQbuSCcrTl34UDl2hIrCxvOcmBR=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94wa6SrilM9", "text": "@Sandro Vadacca \nU sure", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94wa76uSlUS", "text": "@TimBagels \nNo", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzWA6Yzs1PK0-Gz-Jx4AaABAg.94v4yvfiriU94waD9TWct_", "text": "@GamingNobility \nNailed it.", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugxt-PgXYc62x5Fna2V4AaABAg", "text": "What the %&*@ this is sick!!", "time": "5 months ago", "author": "Barret Wallace", "channel": "UCdg17mb-ZY_9KoigQtNSVpQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJyHJGZo_EJ0LR1DGqOzvN2KD_CsFCzTVT2-IpHx=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgwkebjPRN79kCjQxBp4AaABAg", "text": "This slaps!", "time": "5 months ago", "author": "MitchCyan", "channel": "UCjkii118MGYPWePFNbPOGlA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzxU51QOpaWrQgx-fY1bL7XT-abM4VRnkb0XdTe=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyypbQw_iGeMALbaIN4AaABAg", "text": "Nice!!!", "time": "5 months ago", "author": "シロガネ山レッド", "channel": "UCSBdYuFxt7IL1nDFx2bnBnA", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJx_o7ShqMDLKWB5ct4B6ocIY6kSLhawD1TyBQHimQ=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyJqpUnkB_AI3NGznt4AaABAg", "text": "Masterfully ⭐app", "time": "5 months ago", "author": "Carol Lopez", "channel": "UCStlmvPLX5DgG60x_Kal_5g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJw92yQR4CYuXVOKQhzlOorqbvlWOi_dgp2Ur56B=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzDXDJsI-L9bjtRdIp4AaABAg", "text": "this🌈", "time": "5 months ago", "author": "Connie Patterson", "channel": "UCGw9T901kaltEvVSrJ8-NyQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzY8no0uHQ_egpw5UNG-htS5hmFuyWXzzvC8n5Y=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgzDXDJsI-L9bjtRdIp4AaABAg.94vLIx1d2Xp94vuu2J32aF", "text": "No", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgwfEkMTif8lnFmCuRZ4AaABAg", "text": "Damn, this is epic!", "time": "5 months ago", "author": "Rosemma Jordan 🌹", "channel": "UC3av-YAJrCUUNXkoWWwxxZg", "votes": "2", "photo": "https://yt3.ggpht.com/a/AATXAJy3VLbDBOjH81lnNeGToyG1D7PxIk70mQ4W-AZ9=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugx8eHgawgYPr1g17o54AaABAg", "text": "SupraDarky", "time": "5 months ago", "author": "Music", "channel": "UCPBABXvouruSHg3njOOrnVw", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJw0WXWYIiBT0u3NlCFEwuKibIvAu11YAvWpCS4N=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugx8eHgawgYPr1g17o54AaABAg.94v8YAxOljj94vuvP9DIAP", "text": "Yes that's him", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": "4", "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyWaFeJeBUms-Aj-U94AaABAg", "text": "Hate that this game is forgotten already. Amazing combat, good soundtrack.", "time": "5 months ago", "author": "Zephyr", "channel": "UCKrmZPEjFYQYzMB891Ebp2w", "votes": "9", "photo": "https://yt3.ggpht.com/a/AATXAJx5cT6g_l01fuTMS52wEvUdGlc5AEapL4pU7Dn4lw=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyWaFeJeBUms-Aj-U94AaABAg.94v7U1tqCRY94vacVeJbYL", "text": "Seems to be the fate of a lot of video games that have been released, hype is around for a month and then vanishes only to move onto the next thing. Kinda sad tbh.", "time": "5 months ago", "author": "Abandoned Hope", "channel": "UC6clDfX97zOyu8H_UqET5gQ", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzcALrqMroRQ7NZfXIh9iN9eqLrBe0AnNvEvwyliA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyWaFeJeBUms-Aj-U94AaABAg.94v7U1tqCRY94vuqEwkIHE", "text": "Sold more than a million copies, that's a good chunk more than they anticipated.", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyWaFeJeBUms-Aj-U94AaABAg.94v7U1tqCRY94vus4oEj1C", "text": "@Abandoned Hope \nModern day hype culture", "time": "5 months ago", "author": "Gaming will NEVER be good again", "channel": "UComLSITWF3r2QBjbxVFpo8g", "votes": "1", "photo": "https://yt3.ggpht.com/a/AATXAJzYBlCbeF95WQMSPv-Q-adIUPfmtXK9ssHcPOFS-w=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyWaFeJeBUms-Aj-U94AaABAg.94v7U1tqCRY94xbFCl1Yxs", "text": "@Gaming will NEVER be good again Yup", "time": "5 months ago", "author": "Abandoned Hope", "channel": "UC6clDfX97zOyu8H_UqET5gQ", "votes": 0, "photo": "https://yt3.ggpht.com/a/AATXAJzcALrqMroRQ7NZfXIh9iN9eqLrBe0AnNvEvwyliA=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "Ugy6S5TG2-rssjluU6h4AaABAg", "text": "good choice dude. i havent even played this yet", "time": "5 months ago", "author": "TKG", "channel": "UCxlzuulHgIspIh2weOmwxHw", "votes": "3", "photo": "https://yt3.ggpht.com/a/AATXAJyuy81_jDNj24bOVj6eQ7UnpU2sf_9Km96hkp4b=s48-c-k-c0xffffffff-no-rj-mo"}
{"cid": "UgyjHkwFDsT7M1ks0WJ4AaABAg", "text": "The soundtrack for this game was a surprise in a lot of good aspects. Especially with the mixing of genres and vocal tracks.", "time": "5 months ago", "author": "Azure Alufei", "channel": "UCZ0AYuZcc-nC8gUC2n79xpw", "votes": "5", "photo": "https://yt3.ggpht.com/a/AATXAJy0PQ6EcE8rVncHPcYbbW56lrfSv-viaPd0pllt=s48-c-k-c0xffffffff-no-rj-mo"}
